export type Diary = {
  id: number;
  date: string;
  title: string;
  summary: string;
};

export const allDiaries: Diary[] = [
  {
    "id": 489,
    "date": "2026-02-18",
    "title": "如梦如愿",
    "summary": "又梦到了。"
  },
  {
    "id": 487,
    "date": "2026-02-06",
    "title": "日记",
    "summary": "打字打出了腱鞘炎😂"
  },
  {
    "id": 485,
    "date": "2026-01-26",
    "title": "如梦如愿",
    "summary": "又梦到了。 梦到你和李思颖在说话，记不清聊天内容了，好像是说八卦，又似是说我的不好。但气氛就像以前一起吃饭一样融洽。 李思颖面朝着我，我却看不到你的面容。"
  },
  {
    "id": 483,
    "date": "2025-11-29",
    "title": "《亲密关系》",
    "summary": ""
  },
  {
    "id": 442,
    "date": "2025-11-26",
    "title": "日记",
    "summary": "以前大家说我负能量很强，从大学持续到研究生毕业。自认为也是死气环绕，离经叛道。 分手也被骂“反社会人格”。 工作几年后，习惯于被说能量超强、没见过我比我能量更强的、你精力怎么这么旺盛。其实，也就“卷”而已。 看不到的是，孤身走过的日日夜夜。 关了灯 全都一个样 心里的伤 无法分享 生命 随年月流去 随白发老去 随着你离去 快乐渺无音信 随往事淡去 随梦境睡去 随麻痹的心逐渐远去 天下谁人不识君，天下谁人又识君呢？"
  },
  {
    "id": 440,
    "date": "2025-11-24",
    "title": "日记",
    "summary": "看《小巷人家》，该做的事就应该尽早做。 毕业的恋人，有几对能走到一起呢？"
  },
  {
    "id": 439,
    "date": "2025-11-17",
    "title": "如梦如愿",
    "summary": "又梦到了。"
  },
  {
    "id": 479,
    "date": "2025-10-21",
    "title": "日记",
    "summary": "两年了。 同事聊天时常有说时间过得真快，我却觉得度日如年。刻骨铭心的记忆，于我而言褪色宛如一遍遍抽筋剥皮、刮骨疗毒。 我还是不明白，全心全意相处了五年的生离和死别有什么区别呢？一辈子都见不到了吗？难道就差在血缘关系和法定仪式？走着走着，笑着笑着，想着想着，突如其来就哭了。 我好想你，宝宝。"
  },
  {
    "id": 436,
    "date": "2025-10-21",
    "title": "日记",
    "summary": "31了。生日快乐，妈妈辛苦了。 分手两年了。"
  },
  {
    "id": 430,
    "date": "2025-10-16",
    "title": "日记",
    "summary": "我还是不明白，全心全意相处了五年的生离和死别有什么区别呢？一辈子都见不到了吗？难道差在血缘和法定仪式？ 走着走着，突如其来，笑着笑着，想着想着就哭了。 我好想你，宝宝。"
  },
  {
    "id": 428,
    "date": "2025-10-13",
    "title": "如梦如愿",
    "summary": "又梦到了。 梦到你要生孩子了。我见到妈妈，跪在她面前，抱着她的腿说，我错了。 担心顺产不容易，剖腹产。 梦到你要去游泳，我给你小心翼翼 全心全意地准备。 这个梦真长，一整夜都在。 忙碌了之后，总是有些孤单，也总是想起你，想着能和你倾诉。"
  },
  {
    "id": 427,
    "date": "2025-10-11",
    "title": "如梦如愿",
    "summary": "又梦到了。 你不高兴了，具体是什么原因，我记不住。 我开始哄你，小心翼翼地接近你。想把这些博客一篇篇给你看，想把这两年的事一件件告诉你。"
  },
  {
    "id": 425,
    "date": "2025-10-09",
    "title": "日记",
    "summary": "我好想你。 今天和同事喝了点酒，感觉特别好。他的想法也挺好的，他是乐观的，我是悲观的。 即使70亿人有能够契合的，我也不愿走出来，不愿找人去倾诉去聆听，即使有各种渠道认识各种人。就像他说的，我自己束缚了自己。没办法，我只能这样了。 你没有懂我，我也没有懂你，宝宝。我好想你。"
  },
  {
    "id": 424,
    "date": "2025-10-08",
    "title": "日记",
    "summary": "我好想你。 没有人能够玷污我的精神世界，玷污我们的过往。瞥见、议论，一丝一毫都不允许。"
  },
  {
    "id": 423,
    "date": "2025-09-22",
    "title": "如梦如愿",
    "summary": "又梦到了。 你说，要结婚了。 每次看到QQ音乐和朋友圈背景的照片更新，都会做梦。"
  },
  {
    "id": 420,
    "date": "2025-09-15",
    "title": "企业管理中的群众路线",
    "summary": "群众路线/人民代表/土地政策只是舆论给大众的麻醉剂，本质还是集权，中国社会主义权力层层集权，西方资本主义资本抱团集权，没有集权诞生不出统一的意见。 团队上分散话语，会带来一个无法避免的社交问题，即出事得具体的人背锅。对于90%的人来说，收获高投入的正向回报的意愿，是远低于获得高投入的失败打击的。这个从明面上改变了一个社会基本情况，就是层层分级下的社会/组织，出事后是层层往下背锅，即使是最下面的人背锅，也只是暗地的。所以大家不愿背锅，认为领导在甩锅。除非每个人都想往上走，每个人都期待高概率的高风险正向回报，每个人都得有主观能动性，他们才愿意冲，这是非常难的，否则每个人都去创业了，不能以创业者的态度要求打工仔。企业管理中采用群众路线或许是一次尝试，但本质还是集权。人类社会的阶级是不会消弭的，表现在思想、能力、意识等等方面，这是一种生命进化本能。 一旦大家习惯了随意话语、过分开放、没有共识，看不到领导者们的决策、号召、定性、前进（大部分人就是干活，他们不想背锅，也不想决策，也不想主动，这种时候，群众路线的号召力决策力就是一种定心丸，是一面红旗）。时间长了，即使领导也就丧失威信了，说话也会不好使了。"
  },
  {
    "id": 418,
    "date": "2025-09-13",
    "title": "日记",
    "summary": "或许我的遗憾和执着，对你来说是控制、变态。 对旁观者来说，是情深、痛苦。 这种事，谁又能说的清呢？ 就像分手时，你问了你的朋友闺蜜，都建议你分手。我至今仍不明白，她们是如何做出这种建议的。 清官难断家务事；一个人尝试说服另一个人认同或改变一个观点，是很难的。诸如此类道理，都是在阐述这个为人处事之道。那时的她们和你都不知道，你们拆散的是我未来的家，打碎的是我的心。 这两年的几个女生，对我来说，似乎只是疗愈方式、求生工具。但没有真切的疗愈效果，一点点都没有。深埋心底，只是能够笑着自我调侃，迎合观众罢了。"
  },
  {
    "id": 416,
    "date": "2025-09-13",
    "title": "如梦如愿",
    "summary": "又梦到了。 梦到你发了一个演唱会视频，林川。 你说你期待了很久。终于去了。 我亏欠你确实挺多的，没有持久的能力，又得想着以后。 镜头下的你，似乎是镜头拍摄者故意和你离开了一段距离，以便录制。 没几秒，你突然发现了视频镜头，脸上洋溢起惊喜、幸福的笑容， 恰逢此时，主持人刚好此时问有没有人愿意上台互动？ 你大声喊：我我我！边上台边喊：太激动了，好开心。 似乎是对那精心的视频录制的幸福回应。 还是那个你，活泼的劲儿一点没变。 画风一转，到了另一个视角。 你认为，我知道你在哪里工作，哪里生活，日常如何。 我以一个偷窥窗户者的视角，知道你在哪里住，能听到你和别人的对话。 别人问：他怎么样了？ 你带着一股厌恶和冷漠的语气回道：好像搬到附近了，似明似暗。 转向他时，脸上又重新获得了幸福。 在前年那段破灭时间里，变态、控制狂、煞笔、去你妈的、没钱… 你懂了我的阴暗自卑，却没似乎没懂我。 是我的错，让你记住的都是我的恶。"
  },
  {
    "id": 407,
    "date": "2025-09-01",
    "title": "《漂白》",
    "summary": "看到很多人骂这部剧烂尾，编剧傻逼、侮辱警察智商、女主弱智等等。 个人是这么看的： 王千源饰演的匪徒，是个“汉子/男人”。"
  },
  {
    "id": 403,
    "date": "2025-08-30",
    "title": "如梦如愿",
    "summary": "又梦到了。 看着你似梦非梦的背影，我大喊： 我好想你。我走不出来了，怎么办。 为什么我要那样对你？不好的那样。 为什么我愿意全心全意对你好，却又那么有不好的地方呢？ 为什么要因为那些不好的地方，而分开呢？ 我好后悔，我好想你。 憋屈、后悔、遗憾、疼痛。 又哭了。"
  },
  {
    "id": 404,
    "date": "2025-08-27",
    "title": "日记",
    "summary": "我妈这段时间在杭州和我一起住。 明天她就要回家了。 早上起床洗漱。 我说，也许过些天，我开车回家，过年我就不回家了。 妈妈说，过年不回家，像什么？ 你不讲人就不讲，不成家就不成家。 你不回家，你到哪里去呢？ 过年还是要回家。 听到“不成家就不成家”，瞬间我就哭了，用水使劲洗脸，掩盖眼泪。 妈妈还是太懂我了，我何以至此啊？ 回不去了，再也回不去了。"
  },
  {
    "id": 400,
    "date": "2025-08-21",
    "title": "日记",
    "summary": "产品与公司，相比于以往，进步是容易的。 但相比于头部，超越是不容易的。 无数次进步，有可能带来一次超越。"
  },
  {
    "id": 398,
    "date": "2025-08-12",
    "title": "如梦如愿",
    "summary": "又梦到了。 看到了你。 想大声跟你说，我好想你。 还没说出来，已经哭了。 一直没说出来。"
  },
  {
    "id": 397,
    "date": "2025-08-07",
    "title": "日记",
    "summary": "我弟弟说他周末要去川西，先抵达成都。 我问他住在哪里，他说住在峨眉山饭店。我原以为在峨眉山。 他又补充道，在市中心附近，大悦城旁边。 我心里一惊。 大悦城，好熟悉又好心酸的名字。"
  },
  {
    "id": 395,
    "date": "2025-08-04",
    "title": "随手记",
    "summary": "烟，也是一种政治经济技术学的工具。和毒品、芬太尼一样。"
  },
  {
    "id": 391,
    "date": "2025-08-01",
    "title": "随手记",
    "summary": "理想撞击乘龙测试舆论事件"
  },
  {
    "id": 375,
    "date": "2025-08-01",
    "title": "兜底具象化",
    "summary": "以前只知兜底，就是一个能力强的人或团队，能搞得定某件其他人或其他团队搞不定的事情，并且兜底难题的解决方案负责。感触不深。 突然有一刻明白，兜底是与其他的制度冲突的。 如果说职场上分清权、利、责，应该没有人会反对。毕竟不是我做的，我不做；是我做的，我不推诿；谁的问题谁负责。公平公正。 实际操作过程中，却会出现一种无法界定责任的问题，追溯来追溯去，最终会被定义为制度/流程问题。 一方面，制度/流程又是改变最慢的事情，需要长时间的尝试与沉淀。如果团队初始阶段就着手追溯问题、推进流程变革，时间、精力就消耗了。最终，难题没有解决，有待下一次改进，大公司有资源能够试错纠正，小团队却是不能，因为每错失一次机会、一个项目、一份信任，做起来的概率也就越低。 一个机器人项目，机器人偏离既定路线的难题。 拓扑地图绘制→调度平台下发坐标→机器人定位+导航→电机编码。 每一个环节都是沟通成本。 SLAM不是横平竖直的，需要拓扑地图能够与SLAM对应。 拓扑地图支持小曲线，但机器人控制器不支持二维码导航下的曲线路径。 调度平台下发坐标保留两位小数，可能导致机器人长路径运动时越跑越偏。 电机编码存在0.5度的误差，可能导致机器人偏离路径。 可以看见的是，很明显是机器人车载的问题。人工绘图、调度平台、机器人控制器、电机驱动器，谁都不愿主动站出来说，我来做一个精度对齐。车载频繁沟通，展示自己的主动配合，但实际问题没有解决，一个项目做了一月又一月，最终大领导下来视察，为什么搞这么久？谁的问题？没有谁的问题，因为各方的态度都很好，在整个过程中都很配合。即使我技术不行，搞不定难题，但我态度值得肯定，也就没有下文了。最终归为前期各方没有做好对接，管理的问题，制度/流程的问题。一个项目也就做死掉了。 这个过程中，还有个有趣的是：前期正常阶段，似乎少了一个决策，定下来谁来搞定？后期风险阶段，为什么没人愿意主动站出来兜底？ 另一方面，又不能没有制度/流程，在一定度内的制度/流程是必须的，否则又会滋生懒散之风，因为懒散是人的天性。 这在某种程度上印证了项目管理的敏捷概念，对于快节奏的创业型团队，不能太关注流程和制度，也不能太细分责任。面对难题时，有人兜底，是问题推进的一个决定性力量。 个体和互动 高于 流程和工具。 工作的软件 高于 详尽的文档。 客户合作 高于 合同谈判。 响应变化 高于 遵循计划。 如果没有真正创业理想和奉献意识的人，很难去创业，因为自私必定与创业某一阶段不求回报投入的理念相冲突，进而影响工作热情和团队士气。"
  },
  {
    "id": 389,
    "date": "2025-07-31",
    "title": "芬太尼小思后续",
    "summary": "前两天写了芬太尼和毒品的一些感想。毒品以人或身体为直接的价值产生载体，消解身体与精神，快速榨取巨大的经济价值。 今天看福柯的《规训与惩罚》，提到了同样的观点，深度共鸣。正如书中所写： 肉体基本上是作为一种生产力而受到权力和支配关系的干预；只有在它被某种征服体制所控制时，它才可能形成为一种劳动力(在这种体制中，需求也是一种被精心培养、计算和使用的政治工具)。 只有在肉体既具有生产能力又被驯服时，它才能变成一种有用的力量。 毒品，以相反于福柯笔下的“对受罚者的惩罚”，作为一种“吸毒者的主动享受”手段，作用于贩毒、吸毒的整个交易过程中，是某种可以称为肉体的政治经济技术学的缩影。"
  },
  {
    "id": 365,
    "date": "2025-07-30",
    "title": "论关系",
    "summary": "不能把爱情男人看的太重要……看的太重要，结果还会被男人嫌弃。 对女人不能太好，太好的话，她就会不珍惜。 相处过程要保持自己的态度，哪个先妥协就会丢失自我。 相处有时候得互相拎一拎，有时候给面子，有时候给台阶，有时候给态度。 以上。鸡汤，毒鸡汤。 虽然确实有中国人处事的策略，而且不只是爱情，其他关系都有如此情景，包含友情、爱情等等。但有没有可能，应用这种策略，就是因为前期没有做好呢？本来就不匹配，然后才诞生了这些所谓的策略呢？ 每个人都是个体，个体已经有自己的意识。凡是能损害或践踏到个体意识的关系，都是不正常、不长久的，并且任何策略都是无济于事、表面工程。 我们排除这种策略，其实是根本在于对于边界、个体、合作的认知水平。 以爱情而言。 真正要关注的是，三观类似，认知相同，追求相同，互相依靠，留有空间。能以天、月、年来计算，在一起生活，细枝末节的东西反而是一种高要求，比如和异性单独吃了个饭没有汇报，比如出差一个月经常见不到，甚至比如出轨打了个炮。 中国式传统爱情大概率会绑架个体。因为始终宣扬类似于贤、良、淑、德、恭、俭、让之类的价值观，日积月累年复一年，一定会沉淀对人性的压迫。某种情境某种时候不一样的发声，反而大家觉得是“他”疯了，不符合社会规范。 没有两个人在一起能完全刚好互补。看到的大街上爷爷奶奶很幸福，可能价值观根本不合，可能是磨合了几十年，可能是到老得过且过？看到的牛郎织女，可能是男主外女主内，可能是三从四德，可能是婆媳关系有问题，可能牛郎有臭袜子要洗？ 相对于其他关系，在刻板印象中，为什么爱情是更加深刻的情感？以及其产生的婚姻，是更加深刻的关系？或者进一步，换个词，契约。 抽象来看，婚姻关系相比于一般关系，区别有二： 本质来看，婚姻关系超过一般关系，是因为利益绑定、风雨同舟，或者说：真正共享、共情、共担人性阴暗面。 综上，风雨同舟、互相成长，共度这几十年光阴才是难的。当然，这是句废话。再一次相信婚礼誓词：“无论是顺境或逆境、富裕或贫穷、健康或疾病、快乐或忧愁，不离不弃，一生一世”，蕴含了人类最朴素的向往。 其中，边界和自由仍然是有意思的话题。 如果自己一个人能够自洽，是否恋爱、结婚甚至其他关系，也就没那么必要了。 尽量不对其他人产生影响。不管是好的或坏的，都是自以为是。"
  },
  {
    "id": 360,
    "date": "2025-07-28",
    "title": "日记",
    "summary": "成事，得学会低头。 变革，得先会过渡。 比如一家公司当前的产品流程不合理，不用分支管理开发环境、测试环境、稳定性环境的产品版本，自己的能动空间有限，无法改变领导意志。那得在现状下求生，就得迎合领导意志，在既定路线下尽量做到最优，即使违心。 过渡阶段是痛苦的，不只是流程不合理带来的协作痛苦，也是硬着头皮做自己不认可的心理痛苦。 既是一种做事方法，也是一种做人方法。"
  },
  {
    "id": 354,
    "date": "2025-07-28",
    "title": "芬太尼小思",
    "summary": "世人皆知，毒品消解精神和体魄。 但有意思的是，毒品能在短期内给贩卖者带来巨大经济价值。吸毒者数量越多，产生收益越大，速度越快。它将吸毒者作为产生价值的直接来源或代价，远比正规意义上劳动产生的劳动价值、剩余价值大得多。 符合社会价值观的正规劳动，通过劳动者的健康、时间产生价值。毒品这种不符合社会价值观的人性“负面”需求，本质上是以吸毒者的精神和体魄为代价，极端地换取高额价值和利润，虽不可称之为“劳动”，但也是一种价值交换。产生价值的成本极低，速度极快，成瘾极强。 以鸦片输华为例，鸦片消解了中国人的精神和体魄，电影中瘦骨嶙峋、意志沉沦的画面比比皆是。但更为隐蔽和重要的是，只要让人成瘾，并让大量的人成瘾，就能在短期内榨取大量价值，并且这种收入只需要极少的成本，代价只是使用者的身体而已，贩卖者对此并不关注。清政府的巨额赔偿、日政府的战争经费，很难说不是合谋，以人民为直接来源或代价。 成人影片同理。稍微看上去符合社会价值观，或能被现行框架允许，或能成为统治工具的短视频，本质也没什么区别了。 工业、制造业、高科技行业在这些“负需求”面前就不值一提了。 最后，看到贸易战中，美中焦点之一的中国输美芬太尼，可用于制作毒品，就有意思了。"
  },
  {
    "id": 333,
    "date": "2025-07-14",
    "title": "后来的我们",
    "summary": "没有一天不想起。 每每看到背景、头像、签名甚至QQ歌单的变化，总是要好几天才能恢复。"
  },
  {
    "id": 332,
    "date": "2025-07-14",
    "title": "如梦如愿",
    "summary": "买了车似乎没那么高兴。 昨晚又梦到了，在经历那么多之后，其实连官方客套的话也没有说。我的努力只是为了证明自己配得上，“不降低生活质量”。压力、焦虑之后，动作变形。控诉我我的不好，又何时理解过我呢？ 看照片，看着看着就哭了。稚嫩的面容，却经历了日后的巨大打击。乖乖。"
  },
  {
    "id": 337,
    "date": "2025-07-13",
    "title": "日记",
    "summary": "心血来潮，重新下载了《单向度 超真实 内爆——批判视野中的当代西方传播思想研究》。 我的传播学启蒙书籍，也是涉猎社会、人文、个体、环境、宗教、哲学的“引路者”。 考研那会儿，作为理科生，第一次接触交叉于社会学、人类学、新闻学的传播批判学派，犹如天书，像做英语阅读理解，又像翻译文言文。幸好一字一词，翻阅文献，查找资料、标记注释。 我一直模糊地认为，被我妈按斤卖了。突然想起来，我有一堆“视若珍宝”的书留在她家。"
  },
  {
    "id": 335,
    "date": "2025-07-11",
    "title": "后来的我们",
    "summary": "我好想你 宝宝"
  },
  {
    "id": 383,
    "date": "2025-07-11",
    "title": "《以法之名》",
    "summary": "找老婆，不能随便找，要识大体、顾大局，假精明是假的 顾全大局，为了大局即使牺牲小部分人的利益，要维护稳定、团建和发展 引蛇出洞，不要急于求成"
  },
  {
    "id": 330,
    "date": "2025-07-10",
    "title": "随手记",
    "summary": "领导可以知错就改，但不会认错。"
  },
  {
    "id": 329,
    "date": "2025-07-08",
    "title": "何以为家",
    "summary": ""
  },
  {
    "id": 325,
    "date": "2025-07-06",
    "title": "性情中人",
    "summary": ""
  },
  {
    "id": 319,
    "date": "2025-07-03",
    "title": "论成长上限",
    "summary": "工作上限取决于教育背景、工作经历、生活经历，最重要的是反思。 教育背景包括专业精度和专业广度。精度是指高分进名校的尖子生，必须承认的是，这些尖子生从小培养的逻辑思维大概率是优于普通学校的学生的，能够快速且精准地从复杂的事物中抽丝剥茧出关键信息，并做出理性应对。广度是指多学科交叉背景的学生，有条件培养出多视角的宏观视野，尤其是中国文理分科形势下，兼具文理思维模式的学生，也即是理性和感性的交融，在复杂环境中更能柔韧有余，并能基于思维发散出不同解释。 但条条大路通罗马，精度更优还是广度更优，最终还是要看反思能力，跟理科生讲设计、讲人文、讲情怀，跟文科生讲证明、讲精确、讲线性，就是对牛弹琴了。即使装作理解认同，但内心是无法真正共情的，因为解释世界的思维已经决定了。不同学科的理论是无涯的，有时候理科生苦苦思索的社会问题，其实社会科学上早已有了一大堆理论阐述，比如“批判学派”，有时候文科生苦苦钻研的技术问题，其实计算科学上一个工具就能解决，比如“算法”，有时候大家苦苦探讨的工作流程和团队协作，其实管理科学上早已有了明确梳理和可借鉴规范，比“群体行为”。 大多数人的社会阅历通常来源于职场经历，职场上的斗争、厮杀、利益往往比生活中来得更直接。几十上百个待办事项、几十上百个员工协作、几十上百个团队交涉，要下沉其中，会极大考验人情事故、团队管理、身体素质、精神状态、项目管理、战略定力等能力。说到底，人情世故还是主导职场工作表现的关键因素。 生活经历就是成长环境，决定了世界观念、人生观念、价值观念的基本形状。直面过生死离别的人，通常更加一往无前、淡定自若，这种淡定自若不是遇事急躁与否的简单评价，而是没什么可失去的隐隐死气，不服就干生死看淡。生活条件相对好的家庭，孩子通常会更早地意识到社会的本质，比如亲情、责任、利益、消费，比如大场合的应对，比如奢侈品就是普通衣物，比如住小房子压抑生活体验等等。两者在不同情境下也会表现出不同的情绪和处理方法，因为在他们两者的视角下看到的世界是不一样的，而且很难相通。 至于反思，最快最深刻的成长，在于反思。经历了天大的事，不做反思，只能说经历了一遭。反思之后不做学习，也只是纸上谈兵。"
  },
  {
    "id": 318,
    "date": "2025-07-02",
    "title": "如梦如愿",
    "summary": "又梦到了。 你开了一辆玛莎拉蒂SUV，说你最近很忙，爸爸似乎因为那件事需要尽快看到你结婚，你在准备结婚的事情。 带着职场女性、成熟女性的气质。已不再是那个小朋友了。 你什么也没跟说，我就静静看着你，似乎知道你心中所想。 你让我重新找个人，好好生活。 然后开车离去了。"
  },
  {
    "id": 316,
    "date": "2025-06-26",
    "title": "",
    "summary": "将是将，卒是卒。 有时候卒就是为了将而冲锋和牺牲的。"
  },
  {
    "id": 311,
    "date": "2025-06-20",
    "title": "后来的我们",
    "summary": "历历在目 绞痛 愧疚"
  },
  {
    "id": 307,
    "date": "2025-06-18",
    "title": "日记",
    "summary": "产品管理：人人都是产品经理，不是人人对产品整体指手画脚，是人人提意见，在大的产品方向下，开发对自己子平台负责到底。管好产品，既要统一方向，又要贴近用户，经验论就会返工。\n\n项目管理：进度管理不是各负责各的子平台进度，是在大的项目进度下，统一协调各个子平台进度；风险管理不是人人在群里说一下自己看到的风险，是汇总全部风险，并做出优先级判断；相关方管理不是人人对接一下，要不是产品强到别人无话可说，要不是人情世故。管好项目，既要全局把握，又要事务巨细，人人对接就会增加成本。\n\n确认团队结构\n\n要不做成项目型团队，每个开发既是开发，也是研发项目经理，也是产品经理，对手上的项目负责到底。负责到底意味着频繁出差、事务巨细、经常加班、生活牺牲。这种结构，不需要产品经理。\n\n要不做成产品型团队，确定好边界，统一好口径和方向，做开发就做开发，需要技术对接再对接，做产品的做产品，调研市场对接用户呈现需求产品推广。这种结构，只需要产品经理，但业内生存不了。\n\n要不做成项目+产品型团队，现在就思考哪些人以后可能做项目，哪些人以后可能做产品。这种结构，所有收束到产品经理+项目经理身上，在产品和项目框架内运行。\n\n确认人员定位\n\n哪些人做管理，走M序列。\n\n哪些人做技术，走P序列，但P序列也带有管理性质，比如组长。\n\n哪些人是组长，哪些人是组员，只有title，也比title和money都没有要好，最好就是title、money、dream都有了，dream是一直存在，润物细无声的。title可以激烈组长的能动性，对整组负责。\n\n但可能又要考虑能力和资历的问题，很简单能力优先，华为是这样，但领导做选择不容易，实际操作也不容易。\n\n不是每个人都有那个主观意愿对产品全景有了解的，即使大家最后能达到主观能动性的最大发挥。了解意味着担责，担责意味着收益，每个人是否都愿意在当前的收益下，做超出收益之外的事情，因为主观能动性、产品梦想、成事追求吗？\n\n合作团结、理解他人不是强制出来的，或创造条件塑造出来的，而是感化出来的，实践出来的。\n\n如果问题是形式主义，那除非主观性极强，否则问题的答案一定会衍生出形式主义、敷衍、隐瞒等。\n\n物竞天择，奖惩制度做明显的差异化，比如做得好升title，做不好降title，做得最好加6个月，做得正常的就0，只是举例，如果没有客观条件，可以通过其他方式。\n\n允许个性差异化，只要不影响整体节奏。\n\n阶段性突破并提前爆出demo的敏捷价值，声誉出去了，以战养战，等到一次性拿出超越的解决方案，市场已经丢了，比如mapf和ai的过渡阶段。\n\n平衡可以小滋润，但没有赌徒心态、打破规则、融入环境，大滋润不行。\n\n培养所有人的个人能力，学校这种组织适合；企业竞争导向，人一多一定会分层，不能指望每个人都成长得一样，不然领导精力消耗会很累，团队节奏也会被拖累。\n\n自由讨论和公共领域，适合文化领域；大公司权责清晰有主线，创业团队也一样也要，七嘴八舌节奏会乱，建议可以，但决定和方向只有一个。"
  },
  {
    "id": 304,
    "date": "2025-06-18",
    "title": "日记",
    "summary": "需要注意本分、情分、理想之间的区别。 一句老话常说，怎么怎么样是本分，怎么怎么样是情分。现在还需要加一个理想。 工作中，做好自己的事是本分，并且不拖后腿、不阻塞他人。 协助团队做好团队的事，牺牲部分自我时间，没有人处理难题站出来，这是情分。 加班没工资、调休，出差没补贴、慰问，行事没权力、话语，还希望推动所有事情落地，希望以自己的力量和能量带动从情绪上感染，而没有物质激励，那就是理想 但有时候有的人总是没法把握这个度，比如领导无法把握度，看谁是牛马就拼命压榨，超出了本分、情分的范围；员工无法把握度，太老实被当作牛马压榨或太自私只做范围内的事，其实都无可厚非，本质上是管理文化和员工不合而已，招人招错了或文化的力量还没生效。"
  },
  {
    "id": 296,
    "date": "2025-06-14",
    "title": "日记",
    "summary": "成长的过程，生命的意义，有苦说不出。没有人能在觉醒之路上真正共情。 天蓝色，白砖灰泥真美，空气真好。"
  },
  {
    "id": 339,
    "date": "2025-06-10",
    "title": "日记",
    "summary": "下班了，空荡荡的。"
  },
  {
    "id": 366,
    "date": "2025-06-09",
    "title": "日记",
    "summary": "不同组织形态，应该适应不同的项目管理形式，项目管理不限于狭义的项目管理，其实就是一种流程、理念和制度的实践，包括产品、项目、部门、人员、方法论的共进和协作。 我觉得在某种程度上，如果一味生搬硬套，上限也就决定了。任何斗争/进步/商业中的本质，还是思想、逻辑、方法论的比拼。 见路不走，实事求是。"
  },
  {
    "id": 260,
    "date": "2025-06-09",
    "title": "🎂",
    "summary": ""
  },
  {
    "id": 480,
    "date": "2025-05-28",
    "title": "日记",
    "summary": "一本文学小说带来的如鲠在喉。 《遥远的天国》，电视剧《天道》原著，推荐。"
  },
  {
    "id": 293,
    "date": "2025-05-04",
    "title": "如梦如愿",
    "summary": "又梦到了。 她给他梳头，她给他整理衣服，她和他一起去沙漠，一起骑骆驼。 我好心酸。"
  },
  {
    "id": 287,
    "date": "2025-05-03",
    "title": "后来的我们",
    "summary": ""
  },
  {
    "id": 285,
    "date": "2025-05-02",
    "title": "如梦如愿",
    "summary": "又梦到了。 我大喊大叫：我好难受啊，我的全部。"
  },
  {
    "id": 289,
    "date": "2025-05-01",
    "title": "后来的我们",
    "summary": ""
  },
  {
    "id": 258,
    "date": "2025-04-30",
    "title": "🧎🏻",
    "summary": ""
  },
  {
    "id": 292,
    "date": "2025-04-29",
    "title": "后来的我们",
    "summary": ""
  },
  {
    "id": 276,
    "date": "2025-04-26",
    "title": "论生命",
    "summary": "读研三年对我最大的价值在于，在残次的理科思维与价值观上，见识并逐渐培养了残次的文科思维与价值观。 大学毕业找工作和考研那会儿，我就在想文理分科是国内教育对人格/人性最大的损害之一。这么多年过来，高考改革、国外了解、自身经历，我已经可以认为，独立人格的教育都是不完备的。 有趣的是，从理科到文科，反而是从感性到理性的平衡。 另外，开放至今的国内学术、社会、消费、工作、生活，已经隐含着极强的功利主义色彩。 热爱是钻研的前提，即使偶尔心流一下，也比做100次无趣的数据分析更深刻。不要谈什么狗屁新闻快讯、商业逻辑、资本运营、产品设计、能力模型。 生离死别、死亡凝视、权力斗争、社会之恶，一次次质疑社会政治、战争杀戮、资源掠夺，一次次质疑物理时间与空间，一次次接触生死挣扎、穷苦百姓、奔波劳碌。又一次次感动于灯红酒绿、世界之大、点滴美好。没有仰观宇宙之大，俯察品类之盛，就没有资格说理解。即使有，也没有真正的共情。 对于人类这个生命来说，我是谁，从哪里来，到哪里去，时常思考一下是益事。即使在现行标准下身处Forbes榜世界最有权力那个位子上，因为我们终究是一样的。都是人，都是生，都是死。 如果前些年的我，遇到现在的夸奖，我会迷失其中，坚韧、大爱、觉醒、精气神等等。只是因为如果我退了，后面的人就会受到伤害。 大学的时候，我问同学，人活着的意义是什么，同学笑话我说是煞笔，毕业前，我说活着就是为了活着。抱着这个嘲讽和疑惑十年间，接触到余华写的“活着”，数次重温《士兵突击》，接触到逐渐息声的陈丹青，接触到温情有力的戴锦华。 如果如果如果能够选择换命，一个人死，一个人活。选我和我爱的人吧，我不具备剥夺任何人权利的权力，即使是我最恨的人，即使是跟我无关的人，因为我们都一样。红尘滚滚爱恨情仇，过眼云烟。 自从签了捐赠协议，没有一点点后悔，我曾质疑其实际价值，质疑给家人的伤害，但有那么亿万分之一的机会，何不尝试呢？那一丝光和《深蓝》一样。 顺便说一句，生离和死别没有区别。"
  },
  {
    "id": 275,
    "date": "2025-04-25",
    "title": "论生活责任",
    "summary": "没法逃脱的责任，如影随形。嘴上说要挣脱各种束缚，也对很多人说，成长和跨越意味着跟过往做割舍，包括传统的、糟粕的，也包括美好的。 比如对全力追求金钱权力，通常意味着无法兼顾家庭。若真正有收获，需要首先意识到并敢于舍弃糟粕，其次在追求的过程中，还要狠下心丢失一部分美好。要完全割舍，但又割舍不得。 若陷入极端的境地，那必将在某方面收获，而在另一方面失去。 从第一性角度出发，为什么一定要追求金钱权力？成长环境、个人追求、社会文化等都是影响因素。 我希望我爱的人可以生活得更好，狐假虎威终究是个面具，步调快、气势凶、眼神毒，话语密、头脑活，对于原本不是这样的一个人来说，成长到这一步，没人能够感同身受其中的撕裂与痛楚。因为我退了，金钱权力就远离了；我退了，身后的人就承受压力；我退了，未来更不可预料；我退了，风险应对和承受能力就更少了。 工作如此，带团队尤其是自负盈亏的团队、共创事业的团队，合作伙伴的团队。团队核心的责任已经让人思考的不仅是那每月的工资口粮，更是团队未来的发展走向，是否会被公司开除，是否能够延续，是否能够壮大。“躺平族”看来仍是打工、螺丝钉，这种已不是事业团队的范畴了。 生活也是如此。我愈发能对上有老下有小的朋友感同身受，父母的养老问题、家庭的日常开支、孩子的教育培养、朋友的关系维系，或者还想时不时提升一下生活质量，旅游、买包、买衣服、小搓一顿，万一再有个小病大灾。扪心自问，有多少人能承受这些？中国家庭的“顶梁柱”压力可想而知。更沉重的是，相当一部分人没有保险或保得少；家里只有“顶梁柱”打工赚钱；父母生了大病得东拼西凑；父母年迈日行万步力有所怠。中国家庭的解决方案，父母、子女、孙子女一起住，节省开支，方便照应，美其名曰三世同堂家庭美满；大山或农村里出来的年轻人，生了孩子在外打拼，有孩子的理所应当地成了留守儿童，父母理所应当地成了孤寡老人，媒体以高高在上的口吻“体恤”人间，还不忘标榜和宣传真善美；有多少媒体知道出来打拼的年轻人，挣不了几个钱，反而迷失于灯红酒绿，刚开始他们揣着家人的希望孤身闯荡，梦想有一天能够衣锦还乡或带家庭飞黄腾达，殊不知“广阔空间，大有作为”，品尝了自由和消费的味道，便一去不复返了。 还有一些，家里上一代甚至上上一代催着结婚生子传宗接代，完全不能理解这种一代代的传承实际是在贫困线反复挣扎，传宗接代也真正变成了生物意义上的生育机器。能给下一代创造保障吗？创造下一代的意义是什么？下一代自己的意义是什么？仅是为了满足自己糟粕的自私心理吧，抑制甚至抹杀了下一代的自我实现需求，也给下一代、下下一代打造了新的牢笼。观念不改变，不经历打碎、撕裂、重塑，世代如此。 如果一个人还有自己的些许抱负，比如改变世界、创造价值，就难上加难了。有的人不是没有理想，只是理想被现实磨灭了。生存需要总归比自我实现需要更急迫。"
  },
  {
    "id": 274,
    "date": "2025-04-25",
    "title": "工业品与消费品",
    "summary": "每次一看到小米，就想起用互联网造手机、造消费品的逻辑去做汽车这个理念。 这就是工业品和消费品的区别，实用性和资本性的区别。"
  },
  {
    "id": 273,
    "date": "2025-04-24",
    "title": "团队责任",
    "summary": "责任大的时候，会有莫名的负罪感、压力、焦虑，担心做不好，后面的人跟着遭罪。 我自己照顾自己，挣扎着站起来，已经很累了，现在背后似乎又有一群人。 其实这种责任或许是自我强加的。 就这样吧。 再试试看。"
  },
  {
    "id": 271,
    "date": "2025-04-23",
    "title": "后来的我们",
    "summary": "看到这个时间，分手、没见面、某天，忍不住鼻子一酸，眼泪止不住掉"
  },
  {
    "id": 231,
    "date": "2025-04-16",
    "title": "后来的我们",
    "summary": "你说好了不走，为什么要骗我？"
  },
  {
    "id": 230,
    "date": "2025-04-16",
    "title": "后来的我们",
    "summary": "我有好多话想跟你说。 没有一天不想你。 生离和死别没什么区别。 到了这里，已经没有退路了。"
  },
  {
    "id": 193,
    "date": "2025-04-05",
    "title": "论鼓励式教育",
    "summary": "今天看了部电影，《制暴：无限杀机》，杰森·斯坦森主演的。 在电影的结尾，杰森和他的女儿在他以前战友夫妻家吃饭。 关注到一个有意思的点是，开餐时，三个成年人的关注点和开餐话题都是围绕一个上小学的小女孩，杰森向问了句：”今天怎么样？“后续的焦点都在小女孩身上。 关键几个要素是： 想到从小接触和长大之后观察到的国内家庭，在这种时刻，一般来说，国内或是阿谀奉承，或是礼尚往来，或是寒暄诉说，或是攀比较量，或是各聊各的，或是沉默不语。鼓励小孩子展开话题的场景并不多见，即使有，也是以孩子为切入点，走个过场，进入攀比的环节，你怎么样，你看看阿姨家的小孩，你要向他学习诸如此类。 在国内看来，小孩子不要管大人的事、小孩子懂什么、小孩子不顾场合，这种处处刻有打压式和功利性文化的教育方式，潜移默化扼杀孩子的天性。鼓励孩子在大人场合或非严肃场合发挥，即使是严肃场合又如何呢？并且不是以孩子为引子展开话题，而且真正关注孩子，给予他们充分的空间，并用心去感受、回应、共情。 鼓励发挥并参与引导，有说有笑并用心反馈，鼓励式教育和家庭温情熠熠生辉。饭前祷告也是一种。 突然意识到，抚养和教育小孩这件事，不止是需要我成熟，我能教好自己，我有物质条件，我能说我能培养孩子的完整独立人格了，还有文化环境的因素。即使我有能力抚养和教育了，孩子成长过程难免会与周遭文化环境产生交互，目前国内良性的文化环境似乎也是匮乏，尤其是消费主义、信息控制、路径受限（阶层固化和集体利益下的培养导向），或许国外在上述例子中这类文化更良性，或许在其他方面又存在问题。 在教育方面，我还远不够。"
  },
  {
    "id": 198,
    "date": "2025-04-02",
    "title": "如梦如愿",
    "summary": "又梦到了。 忘了梦的内容了。"
  },
  {
    "id": 153,
    "date": "2025-03-31",
    "title": "如梦如愿",
    "summary": "又梦到了。 梦到请李文超喝酒。他点了两瓶，好几千。我硬着头皮说没事，点嘛。"
  },
  {
    "id": 19,
    "date": "2025-03-30",
    "title": "论外在",
    "summary": "当不再关注外在，什么样的穿搭是时髦，什么样的发型是年轻，什么样的品味是高尚，什么样的谈吐是有趣。 可能已经丧失了生命的活力，可能丧失了对理想的追求，放弃了对品质的追求，放弃了世俗的评判。什么样的生命才算活力呢？什么的理想才算可及呢？什么样的品质才算高级呢？都在乎心罢了。 没有那么多想表达的，没有那么多想倾诉的，也没有那么多想探讨的。 在世俗标准下，有个收入，养活自己，养活家人，承担想逃脱却逃脱不了又不能逃脱的责任。 同事、同学、朋友，身边的所有人都在一个既定的轨迹，这个轨迹或是自己规划的，又或是环境潜移默化塑造的，但确实都在一个方向前进。我看不清我的路，看不清未来和方向，但我能看到终局。 或许我也是在走命运给我的路，或许我也是在自己路上走着，不管走的是好，是坏，都是我的路。 好坏没有标准的话，人的经历也就不重要了，能走这一趟路就已经不易了，快乐、悲伤、痛苦、离别、相逢都不重要了。 可能有一天会去一个小城市，去一个偏远草原，就一个人待着。可能没到那个时候，又可能永远不会。 可能有一天也会像周围人一样，恋爱结婚生子，工作退休养老，环游冒险体验。可能没到那个时候，又可能永远不会。 想太多，容易累，看太透，容易虚无。有时从虚无回到现实，有时又从现实陷入虚无。 就这样吧。再试试看。"
  },
  {
    "id": 201,
    "date": "2025-03-29",
    "title": "论工作目标导向的具象化",
    "summary": "临时工作打乱生活计划，为了陪同加班而加班，因为陪同是一种沟通、协作、管理手段。 前几天我妈妈在我这里做好了晚饭，下午我说回家吃饭。但下班的时候，一个后端同事进度落后准备加班，刚好我和算法聊到针对异常场景如何热更新地图且不停机进行算法预处理的场景。其实我是可以走的，但为了保持这种团队热情，我选择留下来和同事一起。 我坚信文化的影响潜移默化，包括但不限于事业中的团队文化。当时如果我走了，会对留下的同事产生一次情绪中断（我称为情绪中断，即扫兴，专注场景下的情绪中断会产生心理投射），当晚的加班一定程度上可能是为了工作而工作。加班场景下，一次情绪中断没什么，多次中断会逐渐扼杀事业团队、合作伙伴的初心，污染激情诞生的土壤。背靠背团体中，需要时刻注意引导和暗示陪同性的文化，以塑造团队合力。（🏷️论传播学对我的重构）（🏷️论工作还是事业） 当然，这又和我的原生家庭（中性，不带当下文化环境明显贬义的倾向）成长环境有关，小时候我妈妈会陪同性读书。带来的影响有好有坏，比如情感过浓的胁迫性压力。（🏷️论是非好坏标准）（🏷️论原生家庭的心理投射） 就这样吧。再试试看。（此句仅作为每篇结尾）（🏷️论心理异常和暗示手段）"
  },
  {
    "id": 16,
    "date": "2025-03-29",
    "title": "论工作中的私心",
    "summary": "换了几个团队，形成了现在的行业专家级团队。（🏷️论团队组建） 现在的团队，有同事，有朋友。相当一部分人能深入交流所思所想，且不少时候能相互给予启发和建议，比如对生命体验、对爱情亲情、对事业追求等。 前十年，我时常想，为啥我的所思所行和身边人有所不同甚至格格不入，为啥我的所思所行和甚至会被嗤之一笑甚至不屑一顾，为啥我的觉醒总是慢人一步。（🏷️论自我觉醒） 现在已慢慢不求被理解，因为完全感同身受的事情不存在，所有信息输入都会在个体的基膜内被变形、重组。亲身经历同样的事，也许能获得某些相似体验，但完全一致是达不到的。（🏷️论相处之道）（🏷️论过往成长和亲身经历） 世界很大也很小。世界很大，所有人和事的底层哲学都能在历史上找到前人的思考做参照，目前没遇到不代表不存在，不代表自己是错误的、特立独行的；世界很小，我们所期待的、所向往的会在某个时刻兜兜转转与我们相遇，只是横向对比可能时间上晚一些。 当然，即使现在，我仍然不觉得有一个个体能完全体会我，我也不能完全体会任何一个个体，因为世界没有真正极端意义上的感同身受。（🏷️论量子证明个体的独一无二） 言归正传，即使大家都是朝着打造事业团队、合作伙伴、优雅产品的共同方向前进。但目前还缺乏一些共情、背靠背的体验，私心始终存在。（🏷️论自私）（🏷️论事业伙伴） 目前团队的阶段性目标是向高层和其他各部门证明价值。具体路径，一是确保新版本准时发布，二是确保首个项目稳定交付，三是确保其他协议顺利适配。根据实际情况，关键性事件是确保首个项目稳定交付。从这个角度来说，如何保证项目所需的版本功能健全、系统稳定是最高优先级。 一方面，后端进度明显阻塞，原因是一个后端的主观能动性尚有所欠缺，另一个后端的工作量极度饱和且分散。 另一方面，算法已取得显著甚至行业突破性进展。 衍生出一个非常重要的生态话题，如何在团队甚至公司内形成竞争性生态，又不破坏团队的协作性，不过分打击进展落后的同事，是个平衡艺术、灰度哲学。 具体来说，在项目实施阶段，及时给予反馈或鞭策，根据问题和优先级应用差别性策略；在展示成果阶段，既要以团队为整体证明价值，也要适当展示卓越个体的贡献。 目前在整体目标落地过程中，没有及时肯定对有进展的工作，一味强调了阻塞的赶工。 对于算法同事的正向反馈，和算法组长沟通过，需要进行竞品对比，在保持变量基本一致的前提下，对比算法在规模调度方面的优越性（与我而言，这是一种合理的诉求和管理策略，也是一种私心）。 以前我一直认为团队里简单直接明了，有什么说什么就好了，所有事以结果为导向，甚至为人处事都是这样，实际却忽视了生命的个体性。如果真的那么简单，就不会存在管理学一说了。（🏷️论个体性） 或许这一篇不能叫工作私心，而是团队生态。（🏷️论文化生态建设） 就这样吧。再试试看。（此句仅做每篇结尾）（🏷️论心理异常和暗示手段） 注：🏷️标记之处仅做个人提示，以后自己可能会逐个聊到。"
  },
  {
    "id": 12,
    "date": "2025-03-28",
    "title": "重拾即刻/博客的原因",
    "summary": "重新登录或发表动态不是希望她看到。 目前来看，她和我已是两条线了，两年前组合线已经分叉了。而她那条也已经编织了一条新的组合线。 命运像DNA双螺旋🧬一样。 最近在找一个平台，便于频繁快速发布。 或许有一天嘎了，服务器上还有一些字节较为深刻地描绘我，碳基向硅基的一点过渡，互联网的一点信息，宇宙的一点尘埃。 五年甚至更早一点前，我意识到家家有本难念的经，每个人都有自己的路。更进一步，世界的意义在于智慧个体共同编织的意义网络，人文和科技是人类的一种自我阐释。如果维度小一点，具体到家庭，结合时代和环境变迁，如果家家有一位曹雪芹，家家能出一本《红楼梦》。但这些因素同时满足，何其之难，更不必说知识的阐释已经如此固化，个体的精力如此分散，信息的传播如此碎片，自我的思考如此奢侈，娱乐的成本如此低廉。信息远远比性、酒精、毒品等物理手段更能影响个体，立论依据是那个神圣归因，人是智慧生命，以此区别于目前地球上已知的其他生命。 说多了，总之想随便记录。这种记录带有分享属性。后面应该会具体说到人的社会化和社会性，我问过很多人一个问题，最早是问她，如果没有别人看，是否还发朋友圈等各类社交动态。关于家家都是红楼梦，后面也会慢慢说到（此处标记🏷️）。 微信公众号太重，不便于记录心流。但还是会整理成章后发表。 微博、小红书、知乎、抖音等人声鼎沸、嘈杂虚幻。 国外媒体文化存在差异。 朋友圈已关。 最终又回到即刻，跟几年前又不一样了。 就这样吧。"
  },
  {
    "id": 132,
    "date": "2025-03-28",
    "title": "如梦如愿",
    "summary": "梦到你把QQ音乐歌单一个个清空，我只能看着数字逐渐变小。从三百多到2。 愈发远去，慢慢模糊。 唯一联系是微信通讯录里的空白快捷方式。 唯一动态是QQ音乐被设为隐私歌单的封面。"
  },
  {
    "id": 7,
    "date": "2025-03-27",
    "title": "后来的我们",
    "summary": "最近登录回即刻，看到以前的动态和评论，无意间点了她的头像，进入了主页，没想到最近竟然有动态。幸福的、怀念的、由衷的动态。 没想到过两天她来访了，可能是来拉黑吧。 不敢再点回去。可能点回去有动态，可能没有。可能会对自己产生冲击，可能又不会。会也不能怎么样，不会也不能怎么样。 最近半年意识到，从那件事中走过，真的很坚强，希望她有慰藉。换位思考，我可能做不到，做不到能怎么办呢。不敢想象，不敢面对。 我能看到的是，可能还要五年、十年才能遗忘？可能这辈子也无法遗忘。 六年，十分之一的生命浓缩成两个词，想说声，对不起，谢谢。 极端又诗意点说，假如我们不曾相识，就好了。 祝福她。祝福每一段经历，祝福每一个人，祝福每一个生命。 随风而去吧。 就这样吧。"
  },
  {
    "id": 133,
    "date": "2025-02-25",
    "title": "论大厂团队与创业团队",
    "summary": "标准意味着设限，规则隐性存在于各种流程、思维和方法论。 以前投简历面试不过，事后我会因为自怯说我不适合，现在能说互联网大厂不适合我。野蛮生长和自我探索全方位考验个体极限，于我而言更具空间和意义。 我面试候选者只看三种力量的强弱，一是生命力（为何而战），二是执行力（是否学习），三是批判力（有无反思）。有一个坚定的信仰或追求，持续反思并改进过程，无论付出什么代价，小到工作、生活，大到公司、国家都是这个逻辑（开心生活也是一个过程，也有代价）。 虽然说法很势利，但从自然科学来看，我想不到有什么是不变的（甚至凝结在过去的时间和回忆，可能都是变化的），而从社会科学来看，利益是永恒的。 顺便说一句，极端和平衡是不同处境下生存本能的不同表现状态而已，没有绝对的是非黑白，“能抓到老鼠的都是好猫”。"
  },
  {
    "id": 138,
    "date": "2025-02-03",
    "title": "如梦如愿",
    "summary": "又梦到了。 今夜梦里全是你，一段又一段的碎片。 其中一段： 你带着鸭舌帽，面容有些沧桑的痕迹，不似以前细腻。你牵着我的手，拉着我往前走，在商场下楼梯，因为之前的几段梦，我们聊的大致内容是时过境迁，好多事情都过了，现在就当朋友聊聊天。我对你说，我不知道怎么谈恋爱了。你看着我，似在微笑似在无奈似在诉说似在劝说，眼里带有泪水。 悲醒，泪湿了眼眶。"
  },
  {
    "id": 134,
    "date": "2025-02-01",
    "title": "如梦如愿",
    "summary": "又梦到了。 普瀚在洗碗，我说我来洗吧。普瀚似乎很开心，擦擦手离开了，我接过碗筷洗了起来。他去玩了，我也挺开心的。 但梦境始终有点模糊，愈发能感受到的模糊，缺乏现实的沉浸感，似乎在现实和时间也在提示我，时间过去很久了，要淡忘了。"
  },
  {
    "id": 139,
    "date": "2025-01-09",
    "title": "如梦如愿",
    "summary": "又梦到了。 梦到你们一家几口，带着你男朋友一起在看着像沙滩一样的地方走路，并排着，有说有笑。 弟弟走在前面，蹦蹦跳跳，似乎一切都是上辈子的事情了。 你扭头，似乎余光看到了我，脸色不是很自然，似乎还带有一丝厌恶。 我低着头快步走了。收拾东西，说远离这个地方。 怕碰见，又想碰见。"
  },
  {
    "id": 140,
    "date": "2024-12-19",
    "title": "如梦如愿",
    "summary": "又梦到了。 你把我的微信加回来了。 然后给我发了几张图片和简短的几个文字，没有发语音。但我记不清具体内容了。 我知道当时的你是在想什么，想妈妈了，还有自己照顾自己。你不开心了。 梦中，似乎你和婆婆、外婆、其他家人之间关系不和谐。现任似乎也没在一起了。但梦境只是个人潜意识罢了，现实中肯定是好的，我也希望你生活得更好。 看到你的消息，我给你发了好多串语音，问你状态怎么样，怎么不开心了，一直在安慰你。我好想你。 最后没忍住哭着说，宝宝，我爱你，对不起。"
  },
  {
    "id": 204,
    "date": "2024-12-19",
    "title": "后来的我们",
    "summary": "随风而去了。 向外求，拼命向外求。"
  },
  {
    "id": 344,
    "date": "2024-11-11",
    "title": "日记",
    "summary": "到日本了。"
  },
  {
    "id": 205,
    "date": "2024-11-10",
    "title": "摘录",
    "summary": "“你相信巴黎圣母院有一天会消失吗?”电影《爱在黄昏日落前》里，重逢的女主这么问男主。 北京时间2019年4月16日凌晨巴黎圣母院大火，哥特式塔尖倒塌入熊熊大火中。 白居易说，大多好物不坚牢，彩云易散琉璃脆。 所以，想去的地方一定要去，想做的事请一定要做，梦里梦到的人醒来快去见。他们经不起等。 不要说以后，可能没以后。 想做我想做的事，想多陪陪家人，想见她。"
  },
  {
    "id": 146,
    "date": "2024-11-01",
    "title": "如梦如愿",
    "summary": "又梦到了。 李思颖说他家希望今年就结婚。 爸爸给他打电话，沟通了结婚的事。 你的想法是现在还不想结，不过也能接受。 李思颖还说他家很有钱。我担心这么短时间恋爱结婚，真的是正缘吗？如果没有考察清楚，可能会出问题。"
  },
  {
    "id": 206,
    "date": "2024-10-21",
    "title": "三十的照片",
    "summary": "当30岁生日这天，看到一直确定的信息和照片时，是种什么感受呢？ 为啥是这天呢？"
  },
  {
    "id": 147,
    "date": "2024-10-10",
    "title": "如梦如愿",
    "summary": "又梦到了。 梦到了她、弟弟、爸爸。 最近状态不好吗？爸爸是有什么事情吗？让我们以后照顾好弟弟。 我努力想办法让你开心，带弟弟玩。"
  },
  {
    "id": 148,
    "date": "2024-10-09",
    "title": "如梦如愿",
    "summary": "梦到了。 吃到一根某种食物，突然想到她，不自觉的内心抽搐疼痛，又哭了。"
  },
  {
    "id": 207,
    "date": "2024-09-28",
    "title": "已是末日",
    "summary": "当科学塑造的技术理性、想象编织的故事意义、宗教维持的社会结构，给的答案都不能让我满意，我便再次转身人文主义、个人意志与灵性之旅，找寻自我的答案。 若已然精神不受限于物质，追求不受限于规则，感性不受限于理性，何不掀了这面？ 我爱你，不论变化，你只是你。我也爱我自己，因为在失去你后的每一天都已是末日。"
  },
  {
    "id": 149,
    "date": "2024-09-28",
    "title": "如梦如愿",
    "summary": "恰好一年。 完完整整梦到了一次，也是这一年睡得最好、最自然、最沉浸的一觉。 梦境，竟然有如此抚慰心灵的力量。 梦里，回到了她家里，没去过的家里，应该是曾经提过的老宅，潜意识加了些许修饰。 第一个见到的是爸爸，爸爸说不用收拾家里，1楼和5楼才整理不久，2楼和3楼暂时不用管。所以她的房间在4楼。说完，爸爸就出去了。 随后，陆续见了几个朋友。我在1楼坐着，等她回来。 再见没有想象的冲动和惊喜，反而有些急促和迷茫。像见到了一位普通的朋友，简简单单地寒暄了两句。她上了楼，我走出门散步。 从家门口走到不远处的跳舞广场。4楼微微摆动的窗帘，我真切地感受到，背后那道朝思暮想的身影和若隐若现的目光。 我在广场旁边蹲了下来，人群慢慢聚集。不一会儿，她也下来了，走到广场中间开始跳舞，边跳边环视四周，与人互动。终于，她的目光停顿在了我身上，第一次有了直接眼神交流，眼带笑意，仿佛又一次走进了内心。 她朝我走来，停在面前，依旧微笑。 终于我再也忍不住，一把拉过她的手，紧紧拥在怀里，像从前一样，埋头在她左边的发丝。说出了心底那句“我好想你”。没有拒绝。 牵着她继续往外走去。我指着天空中被夕阳勾勒的金色乌云说，好美。粉红色的霞光渲染了洒满天边的波点状云朵。 我把爸爸的话告诉了她，她笑着问，为什么不让你收拾2楼和3楼？我说可能有些东西不太方便吧。 走到路边，又一次紧紧抱住她，这次很自然。 “宝宝，我好想你，特别想，每天无时无刻不在想。对不起”。终于我完整地说出了这句日日夜夜想说的话。 睁眼慢慢醒来，梦境消散。 梦醒了，又只剩下我一人。 大哭。 “不要走，可以吗？”"
  },
  {
    "id": 21,
    "date": "2024-09-16",
    "title": "她是中心",
    "summary": "基于过去三个时间维度，近五年，近一年，近半年，包括分手、家庭变故、工作变动、生死境遇、心理状态、朋友交流、一些女生等因素导致的自我情感波动，就择偶标准这个话题简单展开。 （考虑到在女性权利和能力提升的当下，一些原先区分性别的标准，似乎可以通用，就统一合到一起描述。） 从生物学或进化心理学的视角看。 身体吸引力：身体对称、外貌健康、皮肤光滑、体态匀称等，通常被视为高生育能力和良好基因的象征。 年轻度：年轻通常象征着高生育能力。可能还包括当下审美的外貌、风格、打扮、姿态、身高、体重等。 荷尔蒙欲望：性激素与男性择偶行为密切相关，不同时代、不同区域下性激素的影响可能不同。 资源提供能力：“生育抚养成本决定女性是倾向于选择更好的供养者”，传统的男性供养转变为共同供养甚至女性供养在当下也是能理解的。 忠诚与承诺：忠诚和长期承诺意愿的男性，单纯从生物角度看，既能确保后代的养育，也能减少伴侣更换的风险（与下面的社会文化角度的忠诚不同）。 从社会文化的视角看。 教育与智慧：我始终不认为学历等价于教育，或者说我认为在一定程度上教育和智慧更有关联性。男性可能看中教育与智慧，是因为这些特质在共同生活和育儿中具有重要意义。 性格与价值观：此点或许是我个人最为看中的因素。从我的角度看，价值观是对宇宙、社会、生命、文明、个体的全面思考，不求深刻，也不求共识，但求同频。性格契合、相似的价值观和兴趣爱好，是长期关系稳定的重要因素。 经济独立：男性注重伴侣的经济能力和职业发展，或许是共同努力，或许是躺平，或许是其他。 社会规范与期望：不同文化对女性/男性的伴侣选择有不同的期望和规范，一些文化强调家庭责任和传统角色，一些文化鼓励个体追求个人发展和独立，一些文化强调忠诚和长期关系，一些文化鼓励男性寻找多个性伴侣。 媒体与流行文化：媒体、电影、广告等塑造了关于“理想伴侣”的形象，相当程度上影响男性/女性的择偶标准，例如成功、魅力、能力、身材、自由、家庭、个体等。是不是最近有个词叫“性张力”也是这么塑造出来的。我学这个但对其深恶痛绝。 从个体差异的视角看。 个人经历：过去的经历，包括成长经历、恋爱经历、性经历、情感经历会影响一个人的伴侣选择的偏好。 人格特质：以往的自己在各种声音中，对爱情或择偶的人格标准，会参考包容、责任、尊重、互助、奉献、忠诚等宏大的人为标准，这些因素也确实会影响女性/男性的择偶标准。 性取向：异性、同性、双性都是可以的。 或许存在一种量表，可以测试个人择偶的关键考量因素。这种因素是随时间推移和个人境遇而变化的，同时也适应社会规范。 仅就爱情这个点（爱情、亲情、友情等本质没有区别，都是爱，只区别于程度和边界而已），记录当下我的感受和困惑，待未来解。 以上。 情感不能理性推敲。因为理性暂时不配，也没有能力。所谓的人类逻辑只是当下的范畴，或许等有一天科学能够解释情感机制才可以。 在善恶、好坏、是非、黑白，都不足以评判的情况下（皆是人为标准，不同视角结论不同），爱是唯一的心向往之。"
  },
  {
    "id": 208,
    "date": "2024-09-15",
    "title": "论情感",
    "summary": "最近关于情感的一些想法。 （考虑到在女性权利和能力提升的当下，一些原先区分性别的标准，似乎可以通用，就统一合到一起描述。） 从生物学或进化心理学的视角看。 身体吸引力：身体对称、外貌健康、皮肤光滑、体态匀称等，通常被视为高生育能力和良好基因的象征。 年轻度：年轻通常象征着高生育能力。可能还包括当下审美的外貌、风格、打扮、姿态、身高、体重等。 荷尔蒙欲望：性激素与男性择偶行为密切相关，不同时代、不同区域下性激素的影响可能不同。 资源提供能力：“生育抚养成本决定女性是倾向于选择更好的供养者”，传统的男性供养转变为共同供养甚至女性供养在当下也是能理解的。 忠诚与承诺：忠诚和长期承诺意愿的男性，单纯从生物角度看，既能确保后代的养育，也能减少伴侣更换的风险（与下面的社会文化角度的忠诚不同）。 从社会文化的视角看。 教育与智慧：我始终不认为学历等价于教育，或者说我认为在一定程度上教育和智慧更有关联性。男性可能看中教育与智慧，是因为这些特质在共同生活和育儿中具有重要意义。 性格与价值观：此点或许是我个人最为看中的因素。从我的角度看，价值观是对宇宙、社会、生命、文明、个体的全面思考，不求深刻，也不求共识，但求同频。性格契合、相似的价值观和兴趣爱好，是长期关系稳定的重要因素。 经济独立：男性注重伴侣的经济能力和职业发展，或许是共同努力，或许是躺平，或许是其他。 社会规范与期望：不同文化对女性/男性的伴侣选择有不同的期望和规范，一些文化强调家庭责任和传统角色，一些文化鼓励个体追求个人发展和独立，一些文化强调忠诚和长期关系，一些文化鼓励男性寻找多个性伴侣。 媒体与流行文化：媒体、电影、广告等塑造了关于“理想伴侣”的形象，相当程度上影响男性/女性的择偶标准，例如成功、魅力、能力、身材、自由、家庭、个体等。是不是最近有个词叫“性张力”也是这么塑造出来的。我学这个但对其深恶痛绝。 从个体差异的视角看。 个人经历：过去的经历，包括成长经历、恋爱经历、性经历、情感经历会影响一个人的伴侣选择的偏好。 人格特质：以往的自己在各种声音中，对爱情或择偶的人格标准，会参考包容、责任、尊重、互助、奉献、忠诚等宏大且多样的指标，这些因素也确实会影响女性/男性的择偶标准。 性取向：异性、同性、双性都是可以的。 前些天看到一个观点说，亲密关系不一定是伴侣，也可以是亲情、友情等；孤独是一种心理状态，而不是一种存在状态，如果亲密关系不合适，最终还是还是孤独。 或许存在一种量表，可以测试个人择偶的关键考量因素。这种因素是随时间推移和个人境遇而变化的，同时也适应社会规范。 考虑以上因素，已经有违内心对爱情的纯粹向往了。 考虑到三个时间维度，过去近五年，过去一年，过去一段时间，包括分手、家庭变故、工作变动、生死抑郁、朋友聊天、一些女生等因素，导致的自我情感波动。仅就爱情这个点，记录当下我的感受和困惑。 1. 爱是超越本能的力量，或者说我相信诞生于人类身上的智慧与情感，可能带有某种命中注定或上帝筛选的意味，所以我对智慧或情感始终期望和信心。 2. 婚姻是形式，但这种形式是人类文明极具代表性的文化产物，是在人类当下能够企及的范围内，一种对爱情最高的、公认的、神圣的诠释与象征。 3. 爱情是完整生命的一部分；爱情是三观一致，不求深度和共识，但求共鸣。 4. 理解和向往世俗爱情，但不能接受陷入世俗。没有波澜和期待。 5. 是否还对爱情（恋爱直至结婚）抱有最纯粹的向往？ 6. 是互动的精神伴侣，还是单向的倾诉伴侣，还是物质伴侣，还是社会规范下的取舍平衡？或者自我约束下的取舍平衡？ 7. 舍弃了某个原则，打破了最纯粹的向往，最终是否会演变成搭伙过日子？ 8. 是否有方法或机会或能力，彻底排除物种延续、家庭传承、社会文化、个体差异的所有因素，保留对爱情纯粹的向往？ 情感不能理性推敲。因为理性暂时不配，也没有能力。所谓的人类逻辑只是当下的范畴，或许等有一天科学能够解释大脑机制才可以。 所以，从当下我的角度，真正的爱是一种持续非冲动、感性非理性、奉献非自私的自我情感，纯粹的爱己是保留这种情感，纯粹的爱人是助别人保留这种情感且能牺牲自己的这种情感。在善恶、好坏、是非、黑白，都不足以评判的情况下（是规则，不同视角结论不同），爱是唯一的心向往之，因为保留和奉献能够评判。 我核心是F人。"
  },
  {
    "id": 299,
    "date": "2024-09-14",
    "title": "遗嘱",
    "summary": "遗体不用于研究，器官如有可能，直接捐献给他人。\n\n不留骨灰，不立墓碑，不设灵位，不办葬礼。\n\n如有资产，一份购置别墅给她。一份变现给父母。"
  },
  {
    "id": 209,
    "date": "2024-09-06",
    "title": "唯一联系",
    "summary": "唯一联系是微信通讯录里的空白快捷方式。 唯一动态是QQ音乐被设为隐私歌单的封面。"
  },
  {
    "id": 267,
    "date": "2024-08-04",
    "title": "🎂",
    "summary": ""
  },
  {
    "id": 210,
    "date": "2024-07-29",
    "title": "似乎也不错",
    "summary": "爷爷奶奶年纪大了，时不我待。 两个人在一起就好，是那个人就好。 在此之前把婚结了吧，让他们看看。 找个地方定居也是一个不错的选择。 工作再搞个事做着似乎也不错。"
  },
  {
    "id": 211,
    "date": "2024-07-27",
    "title": "后来的我们",
    "summary": "我从没想过如何死去，但代替所爱的人去死是个不错的选择。 如果重来一次，我宁愿不认识。 如果有机会，换我死就好了。"
  },
  {
    "id": 212,
    "date": "2024-07-25",
    "title": "致谢",
    "summary": "三年有余，岁月如梭，不觉长短，亦快亦缓。 2021年6月27日，辛丑年五月十八日，曾于阳光下、树影中、校门前徘徊，告别钟声余音袅袅，心有戚戚。初出茅庐，踌躇满志。 2024年7月25日，甲辰年六月二十日，回首间，三年如梦，青石路上尘埃落定，故人远，独我翘首星辰。静坐思量，初心未泯。 踏足南京，蹒跚学步。首次体验标准化产品流程和组织动荡的阴霾，非常规索赔埋下了不择手段的傲慢种子。感谢同事提供的帮助。 转战深圳，兢兢业业。项目实战快速培养了项目管理思维、沟通协作能力和团队归属意识，但也逐步触碰到产品能力瓶颈。感谢领导提供的平台。 再入杭州，破釜沉舟。产品、项目、需求、冲刺、进度、缺陷、OKR，全方位拷问着了人的天性。意料之中的变动意料之外地触发了安全和依赖危机，或许是褪色的记忆重新着色，或许是表达情感的能力退化。或许吧。 产品是迄今十年心理、兴趣和专业结合的产物，不求改变世界但求激动人心。 南京、成都、重庆、杭州、乐山、广汉、深圳、惠州、汕头、广州、佛山、顺德、南充、香港、曼谷、清迈。阳光下的碧海蓝天，渐行渐远。 西藏一行，人轮回了一次。成都一月，心轮回了一次。听懂了如愿、顽固，听懂了外面的世界、后来的我们。只是，生离和死别有什么区别呢？ 当下已能尝试回答的问题：体制or企业？大厂or小厂？条条大路通罗马。兴趣or职业？打工or创业？找到自己真正热爱的事物，并全力以赴。自由、教育、自洽、命运是一些值得探讨的有趣话题。 人总是一方面好奇未来，一方面恐惧未知，向死而生需要勇气。冥冥之中的因果纠缠让人怀疑世界的真实性。 我要感谢同事领导，给予我在项目和产品全生命周期管理的最佳实践，实现从0到1和从1到N的产品迭代，经历产品助理、产品经理、产品总监的能力蜕变。 感谢藏族大哥，寒冬腊月，命不该绝于圣湖，愿多吉卓玛保佑你们。 感谢我的朋友，老田、世友、恬姐、秦老师，在崩溃的边缘拉我一把。 感谢我的故乡，合肥孕育了我，成都重塑了我，文化风情勾勒我的底色。 我还要感谢“后来的我们”，你开拓了我的视野，也使我真正意识到亲密关系中包容、责任、成熟与共识的重要性。还有破碎、沉默、坚强的力量。你追逐，你呼吸，你嚣张的任性，走过的叫足迹，走不到叫憧憬。 感谢三年间遇到的所有人与事，对我的成长亦有帮助。 道德经云：知其雄，守其雌，为天下溪。知其白，守其黑，为天下式。此再去，定将不忘初心，怀瑾握瑜，坦荡如砥。 山河忽晚，人间已秋。爱你所爱的人间，愿你所愿的笑颜，梦你所梦的团圆，愿你所愿的永远。 最后，仍以此结文：感恩我的父母、兄弟、亲人，在我成长路上的陪伴、支持、鼓励、教导，及我能想象的一切。没有你们，就没有现在的我、未来的我。萱草生堂阶，游子行天涯。祈愿亲人久乐长安！"
  },
  {
    "id": 150,
    "date": "2024-06-17",
    "title": "如梦如愿",
    "summary": "又梦到了。 从一个隐秘的透镜中观察到，穿着蓝色的裙子，带上了邓普澣在路边买小吃，三人一起自拍，还亲了你的头发，有说有笑。卷发男生，脸型微胖。我大吼着凭什么，我对你那么好。"
  },
  {
    "id": 151,
    "date": "2024-05-12",
    "title": "如梦如愿",
    "summary": "又梦到了。 态度柔和了很多，还是以前凶巴巴的语气，问我是否事，说只是半合，发了视频说好丑，但我没说话了。"
  },
  {
    "id": 257,
    "date": "2024-04-30",
    "title": "🧎🏻",
    "summary": ""
  },
  {
    "id": 213,
    "date": "2024-04-18",
    "title": "工作中无可奈何的具象化",
    "summary": "我现在终于有一点感触，为什么越做越忙，越忙越做，或者说能力越大，责任越大。 身处那个情境中，当很多事情要经过自己，自己不及时处理会影响别人时，真的会身不由己，稍微有责任心的人应该都会被卷进这种节奏，不只是工作，生活也是。 无可奈何身不由己的事太多了，知道不该做什么比该做什么更重要。而且排别人的期比自己工作本身还要累。"
  },
  {
    "id": 214,
    "date": "2024-04-13",
    "title": "苦难是一种体验",
    "summary": "很多人没有机会，年纪大的人可能有能力，但没有时间和精力，年纪小的人可能有时间和精力，但没有能力。有机会就已经是一种幸运了。 人生本身就是一种磨练，每个人都有自己的艰难、忍受、不公。 苦难是一种体验，人生也是。"
  },
  {
    "id": 215,
    "date": "2024-04-10",
    "title": "如梦如愿",
    "summary": "又梦到了。 梦到去尖岗山，门卫大门口一个布满油烟灰尘的厨房。一堆像是一直等我回去的破铜烂铁。 找到了一些本来丢在那里的东西，一份菠菜，一个煤气灶头，还有一些其他记不清的东西。"
  },
  {
    "id": 217,
    "date": "2024-03-27",
    "title": "后来的我们",
    "summary": "如果梦境是平行宇宙的现实，一缕烛火尚存。"
  },
  {
    "id": 152,
    "date": "2024-03-24",
    "title": "如梦如愿",
    "summary": "梦到打电话，你不说话，我感觉到你不开心，我说你在哪里，我来找你，你还是不说话。我还是买了北京的机票。 梦到去南部，见了二舅，见了婆婆，见了李文韬，见了舅妈和一些其他亲戚，只是没见到你和爸爸。梦到你把那句签名删了。"
  },
  {
    "id": 218,
    "date": "2024-03-19",
    "title": "过程管理与结果导向",
    "summary": "过程管理和结果导向是冲突的，我更看重结果，至于过程你怎么实现，我不在意。 过程管理可以在过程中发现风险，但对于有高度自觉的人来说，不需要过程管理。 但对公司来说，为了规避风险，并管理不那么多自觉的人，还是需要过程管理。 需要因人而异，才是一个好的管理者。"
  },
  {
    "id": 248,
    "date": "2024-02-17",
    "title": "分手那年",
    "summary": "我明天走了，去杭州，后面打算去日本，有机会我就留那边了。我再也没有那么单纯地走在前面能牵着的手了。 我在邓普瀚学校旁租了间房，如果初三课业繁忙要补课，你爸偶尔没来，回家不方便，可以去住，学校西侧300米。 滨江和城三期12栋3401，密码090507。柜子里有箱可能有意义的你的东西，拿走吧，结婚方便的话请告诉我，祝好。"
  },
  {
    "id": 347,
    "date": "2024-01-18",
    "title": "日记",
    "summary": "抑郁了。"
  },
  {
    "id": 348,
    "date": "2024-01-14",
    "title": "日记",
    "summary": "这次再回成都，感觉已物是人非，大家都有自己的生活和工作节奏。 想回的地方回不去，能回的地方不想回。徘徊过多少橱窗，住过多少旅馆。 人生终究是一个人的旅途。 我仍对不起父母亲人。"
  },
  {
    "id": 250,
    "date": "2023-12-31",
    "title": "分手那年",
    "summary": "我会参加心理评估和治疗。如果你曾经有一丝心软，希望能等我，我怕错过就是一辈子。我对不起你，照顾好自己。"
  },
  {
    "id": 219,
    "date": "2023-12-21",
    "title": "主动离职感想",
    "summary": "第一次主动离职，既有不舍，也有担心。对两年的不舍，同事的不舍，城市的不舍。对决策的担忧，以后的担忧，挑战的担忧，不确定性的担忧。 离职意味着走出舒适圈，以前不觉得怎么样，真的到这个时候，才知道主动走出舒适圈是什么。这两年基本把当下公司当下岗位能学的都学了，能建立的都建立了，能推动的都推动了，如果说慢慢沉淀，那就是每天给自己找事做，慢慢重复已成定局的事情，我看到三十岁结婚生子的同事，期待并享受着这种稳定重复的状态，我就知道我做不了一眼看到头的工作。 个人充满了理想主义色彩，在一个理想的团队，追求同样的目标，做理想的事情，获得个人收益的同时，朝着一个方向努力，创造有价值的伟大的产品。背靠背创造价值，不以公司同事论处，而以共同目标和朋友论。 但工作中很难都是真朋友，社会如此，文化亦如此，当所有人都把它当做是工作、公司、谋生手段，鲜活的部分就丢失了。人与人之间，谁又都能知根知底、心意相通呢？能玩的可能会发展成朋友，不能玩的仅是工作对接几面之缘。离别是人生的常态。"
  },
  {
    "id": 220,
    "date": "2023-12-17",
    "title": "分手那年",
    "summary": "三点醒来写了下面这些，希望你会看，这是最后一次给你解释自我，不想终身遗憾，对我来说一遍遍解释到问心无愧，以后才能心安。就像我前些天说的，其实我已不再执着于复合了，也无打算扭转你我各自的想法，你不知我，我不知你，这纯粹是对这几个月你评价我的解释和反叛。 于我而言，我认为这四年多我最大的问题在于，没有在你创伤后一直体谅你、包容你、爱护你，创伤或许没有互相疗愈而是埋下了二次伤害的种子，我永远心怀愧疚，诚挚地跟你说声对不起。"
  },
  {
    "id": 251,
    "date": "2023-12-03",
    "title": "论道义与初心",
    "summary": "这些天，重温《父母爱情》这部经典爱情片，远比前两次更深入，代入感更强，也都逐一记录。越往后看，越觉得剧版改编脱离原著，过于理想。或许是镜头聚焦，暴露更多的缘故，相比姐姐安欣，女主安杰在思虑行事上都要欠缺不少。后面打算再看看原著中的现实与人性，安杰于江德福而言，或许最大的意义在于“一窝一窝地生”，正如作者刘静所说“数量有时候什么也不能说明，只是一次次行为的重复罢了”。 剧版同龄的江德福无论是对家人、对朋友、对战友，思虑周全，处事得体。默默相比而言，在处世之道、价值观上，我似乎并未欠缺多少。区别在于，没有大男子主义，意味着我不易守住底线；说话做事更直更刚，意味着我不会说话不懂让步；没他那个时代，意味着我也没他有本事。 或许是时过境迁，物换星移，周六周日半夜醒来，突然有很多不一样的闪念，记录一下聊以慰藉。 不知各位同学朋友，入世后，还有几人记得那句“铁肩担道义，妙手著文章”？对杨继盛来说，“铁肩担道义”是冒死弹劾权臣的忠君之言；对李大钊来说，“铁肩担道义”是争取民族独立的壮烈之志。对新闻或传播学子来说，“铁肩担道义”或许是一句用来润色考卷的答案，又或许是一碗用来激励新人的鸡汤。曾几何时我还记得，那几年考研，每每读到新闻理想、社会责任、事实真相、激浊扬清，不说热泪盈眶，也总是鸡皮疙瘩起满身。 入世后，同学们似乎没有多少人从事新闻或传播专业，即使是新闻学科班出身的几位，偶尔和他们交谈，似乎那股热情也逐渐在熄灭，暂不论是否这股热情是真是伪，是浑是纯，也不论是被现实浇灭还是本性暴露，第一事实是我越来越少见到那股热情，也包括我。这种热情不仅是新闻或传播专业的热情，更是生活的向往，学生的真诚，年少的轻狂。我们奔波于现实 Deadline 节奏，泯泯于众。 “道义”，道德与正义，通常被认为是一定社会阶段下的一套价值观与行为准则。不同社会阶段或时期，允许道义不同或变化。但我更相信，在人类维度，一套能够历经时间检验并对每个人都普适的价值观与行为准则，才是真正的道义。它不仅能应用于人与人之间的相处，这是人的维度，也能应用于人与自然的相处，这是物的维度。 “天地君亲师”随着历史和社会形态变迁，已不合时宜，这不是真正的道义。 “权责体系”是当下社会阶段宣扬的，是起源于基督教义的西方文化观念，甚至渗入到任何体制的社会、文化、道德和法律中，但也不全然是道义，工作的尽头是权钱，权钱是为生活服务，生活好坏是塑造对比出来的，也是从孩子生下来开始强加的，但凡违背本心的，都是不能长久的，自由其实只是个体对当下社会结构、关系的一种反叛。 “你来我往”是为人出世的根本道义之一，父母养育子女，子女要孝顺报答他们，是一种回报式关系，夫妻之间荣辱与共，同甘共苦，是一种回报式关系，人与自然和谐共生，取之有道，用之有度，也是一种回报式关系，我坚信的“天下熙熙皆为利来，天下攘攘皆为利往”，也是一种回报式关系。 无论是这种回报式关系还是其他，本质都是平衡之道。人能把握好“度”，那就能处事不惊，也能无愧无心。 当然，以上定义仁者见仁智者见智，还涉及一些哲学思辨，世间本就没有对错和善恶之分，皆在人心。 往小了说，近几年我愈发骄躁，急功近利，想要做成一件事的固执与结果导向，竟然被我当作是好事，是能力的体现，殊不知失去了平衡，越想做的越做不成，心平气和去待人接物反而会有不一样的体验。 我愈发不够孝顺，对待身边人没有耐心，尤其是亲人，包容忍耐的一面总是迎合了外人，因为这些外人能够带来即时的利益回报，或屈服于工作职级，或屈服于社交属性，或屈服于经济收益，家人稍微问得多了管得多了，稍微没有让自己满意便会不耐烦，意见不合时便以暴言暴语相对，我竟有些忘了家人才是最大的支撑，我以此劝诫别人但没有劝诫自己，这几年的恋爱经历占据了我80%的时间、精力和情感，我确实没有平衡或融合好爱情与亲情，殊不知但凡感情关系的一方想要割裂爱情与亲情的关系，都不是真正的爱人而是爱己，无论这个人是另一半还是自己的父母。 我愈发大手大脚，不够简单淡泊，面子工程越发严重，甚至激进地歌颂苦难，认为吃得苦中苦方为人上人，陷入了为了节约而节约的陷阱，甚至时常把钱用在刀背上，殊不知苦难并不值得歌颂，顺境和逆境皆能使人进步也能使人退步，在于顺境和逆境的人怎么做，其次人想吃什么吃什么，想穿什么穿什么，想玩什么玩什么，为了内心平和的享乐主义而不是攀比显摆的社交属性面子工程，也是没错，该花钱的时候花钱，该做事的时候做事，才是上上之道。 我愈发对社会的不公和悲惨，能够“冷眼”相待，似乎善念泯灭，对人性的期许有所降低，或许是因为近几年发生在身边的世事变迁的冲击，又或许是看得更多经历了更多之后的平静，但我似乎愈发不能置身事外，时常独处时泪流满面，在旁人面前又冷言冷语孤芳自赏甚至铁石心肠，万事万物皆有其定律，因果循环，目前的我仍不知道这是自私还是大爱。 我愈发在某些情况中，被他人的意见所左右，为了在群体、感情或某种关系中获得认同感，反而舍弃了初心。我始终认为，现实中谋求生存、努力生活的人，都值得尊重和敬佩，无论他从事什么岗位，但趋炎附势、消费主义，是绝不能被接受和效仿的，即使他们看上去可能是快乐。咖啡、旅游、奢侈品、房子、车子、结婚等，如果是分享喜悦给亲朋好友，当然无可厚非，但若有炫耀和显摆心理，都是矫揉造作。评判分享是否单纯的标准是，如果让一个人独处，他是否还有去做这些事情的意愿和想法。所以，拥有超越生命的道义或追求，有自己的坚持和信仰，不受外界或情绪左右，才尤为可贵。自以为是也不是全然不好的词，换个角度看，面对大流能够坚持己见、不平则鸣，何尝不是一种态度？ 近些年国内城市的集中化，鼓励农村人口到城镇就业，表面提高了农民收入，促进了城镇发展，实际是转移劳动力的手段，典型的是深圳外卖小哥，互联网民工与外卖小哥本质没有区别。互联网神话和造富时代正逐渐过去，一是留下了一套互联网方法论，如底层接口、中台概念、前端赋能的架构，能用以革其他产业的命，小米手机、新势力汽车甚至工业4.0等实体经济中已相当成功，二是沉淀了一些代码能力和基础设施，例如云计算体系、物流体系和制造体系，三是塑造了一幅垄断的格局和强大的资本力量。互联网大厂或民工还有什么值得炫耀呢？平台型公司和创业型公司在不同阶段有不同的好处，二者只能是互补，站在平台角度，我不否认创业型公司的灵活多面全局，站在创业型公司角度，我也不否认平台的机会和起点，关键还得看个体，如果随波逐流，那永远是小兵。 以上，我似乎有点忘记“道义”、“初心”、“理想”。"
  },
  {
    "id": 351,
    "date": "2023-11-20",
    "title": "日记",
    "summary": "每份工作兢兢业业，不管是考核还是同事眼中，都是最佳员工， 到头来却被身边人视为几斤几两、吹水，也最先被舍弃。"
  },
  {
    "id": 252,
    "date": "2023-10-14",
    "title": "分手那年",
    "summary": "@溽暑二十 你刚才几个问题的回复： 1.我不是在变相地妥协，而是我意识到我自己的问题，我悔过了，我该改，我该包容，我不跟你争不跟你吵，我希望你能做自己。 2.我确实在深圳说了让你走的话，但我相信我绝对没有用滚这个字眼，也是半开玩笑的语气，我的本心也绝不是这个意思，你爸爸给你买房让你有个落脚的地方没有任何问题，而且就算以后我们在一起，以后买房也是会写你的名字，根本没有上升到那种赶人出门的维度。换位思考一下，好几次过年过节在你家，我是否被撵出去过呢。 3.如果我真的不愿意帮你找房租房，那我就不会说要换房，也不会下着暴雨去看房，更不会被中介骂舔狗傻逼。 4.我再澄清一下，拿剪刀吓你那次，不是单纯刷抖音的问题，是积累了很多问题没解决，你似乎忘了那天我被打耳鸣、嘴巴出血、胳膊血痕吧？我一直也有很多委屈的地方。 5.房地产大概率会下行很多年，而且我也有房子，没有贷款，也能全款买车。你说的父母没有社保，会给以后增加负担，这个我没办法给你准确的答复。承担一些基本的赡养父母的义务，难道不是全世界做人基本的道德吗？难道你觉得在没有社保（不是没有医保）的情况下，我和我弟以后一年小几万的赡养费都拿不出来？ 我没有站在你的对立面，只是想稍微解释一下。 还有以往发生的，我不辩解。我想要提出一些解决方案： 1.以前很多时候确实我有很大问题，我忏悔道歉且改正，但我希望你能跳出情绪和事件本身，想一想来龙去脉和事件本身。我不是在说明你的问题，不是在推卸，我是表达，一来更加客观地为自己为你的家人你的朋友呈现一些事实，他们能改变对我的一些看法。二来或许能消解一些你现在内心对我们争执的情绪。 2.可以找个时间找个地点找家人或朋友，把以往很多事情、很多问题，都拿出来，你说一遍我补充，客观全面地放在第三方面前，让他们判断一下，或许能给一些破局的建议。我知道你的想法最大，我不是在道德绑架或胁迫你。而是兼听则明，看得全听得多，可能我们会有不一样的思路，这也是我现在逐渐接受和改变的一个处事方式。 3.除了脾气和争执，你想想其他我做得好的方面，以及我能够做得好的方面，我基本人格没有问题，品质也没有问题吧。我一定能够做好一个好男朋友、好丈夫、好晚辈、好哥哥、好朋友、好员工等。或许这对你消解一些对我的情绪，也能有一点点帮助。 4.如果叔叔用商人思维来谈的话，但做人做事还是得讲一些良心，这两年某些可能不妥的行为我不置可否，如果你也认同的话，那我们就来谈现实。你要我怎么做才行，才可以给最后一次机会？不管你现在认为我在逼你，还是给机会让自己不舒服等。你列出条件，我现在能做到的和以后能做到的，我都接受，签字画押。这次之后，只要你有任何觉得我有问题的地方，让你不舒服的地方，我再也不纠缠。你没有最后一次机会，那我也没有分手的选项。 5.见面看到我的状态，看到我暴瘦，这不足以成为你回心转意的一点动力。但我真已经在各种崩溃的边缘，吃不下饭，工作不了，生活不了，一切都没有价值和色彩。今天体检医生说可能胃糜烂加重了，不排除更坏的可能，得再做胃镜检查下。你不知道我这一个多月是怎么过来的，我也不知道我后面还会怎么过去，但我清晰知道我的身体生活工作都在破碎。 6.还有工作和入世的一点小建议，不要陷入工作的漩涡和陷阱中，要保持一些自我的节奏。工作只是为了快乐充实而已，最终所有的事情都要回归生活和生命本身，所以有时候不必太在意。"
  },
  {
    "id": 353,
    "date": "2023-10-06",
    "title": "日记",
    "summary": "这个世界好得很。 我还能怎么做呢？"
  },
  {
    "id": 253,
    "date": "2023-09-04",
    "title": "论通俗与高雅",
    "summary": "大众电影、流行音乐、短视频，不可否认是时代的产物，也是时代的记录和见证”，但被掩盖的是，它们都是一种“通俗艺术，用以迎合当下的大众审美、社会发展趋势。 其实大众的审美是被塑造的，而不是自发产生的，“高级”的审美一方面带有创造的起源意义，另一方面也是时代和环境下的产物。 在享受了一顿视觉、听觉盛宴后，大众陷入一种虚幻的过瘾、反思之中。具有某种自我动力因素的文化（自动化文化组织体），将含有多种刺激元素的通俗艺术，投喂给大众，而这些大众恰是在这种文化中成长起来的，他们的喜好是被记录、被分析的、被再利用、被再塑的。 对于通俗艺术中的任何反思都是文化制造者和“自动化文化组织体”引导的结果。 少接触“通俗艺术”，多接触严肃艺术、文学、哲学、科学。 “通俗艺术”这个词并不准确，压根和艺术搭不上边，或许说“麻醉剂”更准确。"
  },
  {
    "id": 262,
    "date": "2023-08-04",
    "title": "🎂",
    "summary": ""
  },
  {
    "id": 254,
    "date": "2023-05-24",
    "title": "争先恐后的人",
    "summary": "为什么不是阳了的人戴口罩，而是不阳的人要戴口罩防护，阳了的才是病人，最后还形成一种心理优势，反正阳是一种普遍现象，戴不戴都无所谓，我不感染你，你迟早也感染，全社会如此。这是什么变态、从众、麻木的思维方式？秉着不影响别人的基本素养，应该是阳人不影响不阳人。\n\n上班途中，没有红绿灯的斑马线，车让人等了很久，中间好不容易有个空挡，车能过去，偏偏会有一个赶死一样的人，感觉让这车过去，自己就过不去一样，在车辆启动之前加快脚步冲了过去，车又得等很久的空挡。换位思考，车不让人的时候，人要说，车让人的时候，人还要车继续让，得寸进尺、不换位思考的也是一个素质缺失点。\n\n不在公共场合大呼小叫，不随地大小便，礼貌助人，这不是素质的全部所指，素质更体现为一种人文素养。另外，即使是大呼小叫、大小便、不礼貌助人，这为什么就是没有素质了？标准谁定的？为什么市中心不能摆摊？席地而坐？市容、城管这些词的来源和意义是什么？\n\n最近的观察是，不影响别人，换位思考和个体利益并不冲突；有个体的边界感，但又具备集体意识；在维护集体利益时，又会团结而不是倒戈、麻木、从众，枪打出头鸟这种观念阻碍集体发展。这些都很缺失。不要把concentrated和collective混淆。"
  },
  {
    "id": 256,
    "date": "2023-04-30",
    "title": "🧎🏻",
    "summary": ""
  },
  {
    "id": 23,
    "date": "2023-04-11",
    "title": "項目型產品經理與產品型產品經理",
    "summary": "不同行業、不同公司對產品的定義有所差別，相應的要求的能力也不一樣。 總結了一下，以目前的了解，對於科技類企業來說，包括軟件和硬件產品，我給產品經理分了個類，一是產品型產品、二是項目型產品。這是基於自己的理解和知識面下的定義，可能不一定正確，只是解釋一下我目前對產品經理的理解。對於其他企業來說，可能就不一定了，暫時沒接觸過，比如最初誕生產品經理這個崗位的寶潔公司，這類實業公司的產品經理可能關注的指標和實操的方法都不一樣。 產品型產品經理就專攻一個產品，比如一個軟件。 B端的話就像給公司內部做的ERP系統、HRMS系統。這樣的產品經理就一直根據公司內部業務方的需求去完善軟件，以前在蘇寧做的在線文檔產品就類似於這種。像科大訊飛這種大企業內部應該都是有團隊做企業級軟件，因為大企業內部業務分工很精細，需求也很獨特，所以很多需要定制的。從Oracle之類的公司採購這種系統投入產出比可能不太高，還不如直接自己定制了。中小型公司可能就直接採購簡單版的企業信息管理系統了，讓公司業務適配系統架構，其實對於一些中小公司來說，使用先進的企業信息管理系統也是規範內部業務流程的一種方式。 C端的話，比如做一個手機APP，像網易云音樂這樣。一直打磨這個產品，面向的是日活上億的個人用戶又可以展開說到B端和C端的區別、市場、趨勢等等，就不展開說那麼多了。另一種項目型產品經理，面向的就是商業化的客戶了，主要模式是公司有一個核心產品。比如現在這家公司，做機器人的，首先有自己的核心能力，機器人硬件和軟件，這一套打包就能賣給不同行業、不同客戶，面向的是B端客戶，就是企業用戶，一般只有工廠、倉庫、物流才會用這類機器人。關鍵在於每一個B端客戶的需求都不一樣，每一個行業、工廠的業務流程都不一樣。 項目型產品經理是基於一個有核心能力、可以產生商業價值、可售賣的產品基礎上，面對不同客戶的需求，進行定制化設計。在面對不同客戶、不同行業、不同需求的過程中，做完一個個項目的過程中，對公司的核心產品能力進行擴展、完善，使其從不規範到規範，從不標準到標準。 產品型產品經理和項目型產品經理，我個人不會界定的特別死，其實有一些交叉的地方，也有一些不同的地方，崗位對於個人的能力要求也會有所不同。 最根本的東西是一樣的，就是產品經理這個崗位本身的基本素養，最根本的、也不宏觀的就是，需求分析 需求轉化 信息傳達 需求實現 項目管理 用戶價值，對產品型產品經理和項目型產品經理其實是一樣的。 最大的不同在於，產品型產品經理更加關注用戶價值，一直打磨完善一個產品，可能一個版本迭代就是優化一個功能、修復一個bug，個人的共情 數據分析能力更加重要。項目型產品經理更加關注怎麼實現對客戶需求的分析、轉化與交付，針對每一個項目，推進項目的落地，協調好資源和相關方，進行風險控制之類，個人的需求落地項目管理能力更加重要。"
  },
  {
    "id": 268,
    "date": "2023-03-25",
    "title": "论学科交叉",
    "summary": "之前我一直認為文學作品是作者個人的思想觀念，自己想象的價值觀，所以我一直是不屑於讀文學作品的。 但我突然發現，每個學科每個領域，只要精深沈澱，都會獲得自己對這個生命意義的認知，都能詮釋出不一樣的風景。文學或許就是所有領域、所有學科裡面的一片淨土。雖然它是作者個體思想的結晶，小說中存在作者本身很多的觀點，但誰又能說文學作家不是認清了生活的真相還繼續熱愛生活？誰又能說文學作家不知道活著就是為了活著？ 將學科進行對比是一件蠢事，評價學科好壞也是一件蠢事。學科、領域或許都是人類自娛自樂的一個場所、一種方式。個體只要從這個領域中尋到了自己對生活真相的一種認知，獲得了內心的平靜，就足夠了。 我對學科的定義迄今經歷了幾個階段： 1.不同學科界限分明，視為學習工作之道。 2.人文主義與科學主義融合才能培養健全人格。 3.學科是認識世界的一種角度和方式。 4.學科是社會發展需要的產物，帶有價值屬性。 5.學科或領域可以成為個體在這個世界中認知自我，認知與世界關係的一種方式。學科或領域我表達的是一種泛化的身份概念，不僅限於個體的學科、領域，可能還包括工作崗位、社會階級等。 所以我認為我的性格、思想甚至人格的某些差異，是因為我還沒有在任一領域中獲得認知與平靜，也是因為我始終排斥文學而沒能在內心建立一片類似文學的淨土。"
  },
  {
    "id": 247,
    "date": "2023-03-10",
    "title": "论文化与技术工具",
    "summary": "有时候历史不只是必然和线性的，也是无数偶然的拼凑和因素的关联，所有事情也都有因果关系 以前觉得文明和科学的进步完全依赖于理科，理科主导世界。当时却不知换个角度想，没有文化演变，￼人类也不知道科学为何物，文化是所有学科的基石，学科是文明的一部分。 搞技术主导不了世界，搞政治搞文化才可以。技术是工具，科技是第一生产力，却不是第一统治力。宏观看，技术永远是统治的手段。"
  },
  {
    "id": 269,
    "date": "2023-02-24",
    "title": "日记",
    "summary": "已经不想局限于做产品、做项目、做业务本身了。 想多承担、接触、见识、积累，学习物联网、网络、云，以产品、技术为跳板，接触更多产业、行业、商业模式，融入物联网这个大环境之中。"
  },
  {
    "id": 369,
    "date": "2022-10-20",
    "title": "日记",
    "summary": "流程耦合性、代码耦合性高，能够在一个流程中更多解决客户的一连串问题，减少客户操作。 所以耦合性和客户操作是成反比的。 需要平衡。"
  },
  {
    "id": 33,
    "date": "2022-07-29",
    "title": "《道德经》",
    "summary": "将欲歙之，必固张之；将欲弱之，必固强之；将欲废之，必固兴之；将欲取之，必固与之。是谓“微明”。柔弱胜刚强。鱼不可脱于渊，国之利器不可以示人。 事物的两重性和矛盾性总是在互相转化，“盛极转衰”“物极必反”“否极泰来”……都是道的体现和自然规律。人们应当抓住这个规律来顺应“道”，同时警醒自己不要把好的东西拿出来炫耀，否则极盛的时刻也代表着衰退的时刻。 大道废，有仁义；智慧出，有大伪；六亲不和，有孝慈；国家昏乱，有忠臣。 好与坏是互相依存而出现的，出现了这些看起来好的元素，必然是坏元素也相应而生了。 致虚极，守静笃。万物并作，吾以观复。夫物芸芸，各复归其根。归根曰静，是曰复命。复命曰常。知常曰明。不知常，妄作，凶。知常容，容乃公。公乃王，王乃天，天乃道，道乃久，没身不殆。 返璞归真，静心静性。 宠辱若惊，贵大患若身。何谓宠辱？宠为上，辱为下。得之若惊，失之若惊，是谓宠辱若惊。何谓贵大患若身？吾所以有大患者，为吾有身；及吾无身，吾有何患？故贵以身为天下者，则可寄于天下；爱以身为天下者，乃可以托于天下。 做公益，就是“以身为天下，可寄于天下” 延迟满足、及时行乐都对身心有伤害。 持而盈之，不如其已。揣而锐之，不可长保。金玉满堂，莫之能守。富贵而骄，自遗其咎。功成、名遂、身退，天之道也。 知名人士功成身退。 媒体报道各种不良事件，对不良事件的再发生，有涵化、推动作用。 不尚贤，使民不争；不贵难得之货，使民不为盗；不见可欲，使民心不乱。 是以圣人之治，虚其心，实其腹，弱[5]其志，强其骨。常使民无知无欲，使夫智者不敢为也。为无为，则无不治。"
  },
  {
    "id": 34,
    "date": "2022-07-02",
    "title": "论技术打工性与文化统治性",
    "summary": "地位高的人有更多的话语权、传播权，包括社会审美等各个方面都是这么被把持。 难找工作的专业是因为社会资本与专业本身不匹配，如社会学、政治学、公共管理、金融，这些专业是为本身阶级和资本高的人准备的，这些人不会去做理工科、计算机之类的东西，因为本质那才是打工的。"
  },
  {
    "id": 26,
    "date": "2022-06-28",
    "title": "论道德经的马太效应哲学",
    "summary": "马太效应和趋同效应，相信很多人不陌生。 马太效应：一种强者愈强、弱者愈弱、赢者通吃的现象。 趋同效应：由于资本的报酬递减规律，当发达地区出现资本报酬递减时，资本就会流向还未出现报酬递减的欠发达地区，其结果是发达地区的增长速度减慢，而欠发达地区的增速加快，最终导致两类地区发达程度的趋同。简单说就是，有一部分人认为，人类社会的各类差距最终不会无限制扩大，而是会逐渐趋同。 两者广泛应用于社会心理学、教育、金融以及科学领域。 让我感到震惊的是，老子《道德经》里提到的：天之道，损有余而补不足。人之道则不然，损不足以奉有余。孰能有余以奉天下，唯有道者。 早在千年前，老子就已经发现并提出这种道理。原来是自己的粗鄙，没有到达能够产生共鸣的地步。我一直坚信《道德经》里有非常多的惊喜、共鸣与先见之明，但我仍然不准备去阅读。还得继续见识。以期待阅读时，思维的碰撞和英雄所见略同的喜悦。"
  },
  {
    "id": 27,
    "date": "2022-06-28",
    "title": "论技术善恶论",
    "summary": "人工智能对信息分发甚至生产的垄断控制，我们意识到信息是人工智能控制和创造的，结果是基于机器学习算法评估的。我们意识到这个，作为创造算法的人、使用人工智能的人，通常来说他们脑力超群，不可能意识不到这个问题。 苏杰在《淘宝十年产品事》中说明：算法越来越强大，转化率越来越高，买家的选择成本越来越低，我们推荐给他的就是最合适的……我们似乎感受到一丝诡异，这样系统就“死”了。买家选择这件事情本身，就是有意义的……主动的智力贡献正是系统进化的源泉之一……系统中，一定有部分人喜欢完全靠算法，放弃选择，我们就让他们生活在Matrix里；也一定有部分人，喜欢自己挑选商品，我们就给他们建立一个”锡安“。（Matrix、锡安来自电影《黑客帝国》中的名词） 看到这里，你想到了什么？对，”圈养“。算法对人的”圈养“。在Matix里，被算法圈养，在锡安里，被算法背后的人圈养。趋势越来越演变为，无论人身处在哪种环境，未来都处于一种全景监视甚至控制之下。消费者处于资本的控制之下，读者处于资讯的控制之下。 技术本身没有善恶的说法，从这个角度来说并不正确。每一种机器学习算法都是针对某种场景的具体应用，没有哪一种机器学习算法是普适的，如图像识别算法是针对图像的，智能推荐算法是针对推荐，文字识别算法是针对文字的，每一个场景是定制化的。因此，这种算法诞生之初就是带有明显目的性和偏向的，并且，大部分科学研究都是被支持的，无论是被政客支持，还是被商人支持，或多或少都是朝着有利于政客、商人期待的方向发展的。科学无国界，也是一个伪命题。"
  },
  {
    "id": 25,
    "date": "2022-06-08",
    "title": "论核心竞争力",
    "summary": "越强大的公司，其供应链能力越强。对公司来说，供应链能力是护城河，包括客户资源、渠道资源等。相当于对人来说，越往后，人脉资源的价值越大。 普通人力资源说到底还是一种劳工，贡献的是相对容易被替代的价值。很多公司说，以人为中心，说的是好听的话而已。 第一层次的个人：普通员工的能力再大（单纯指的技术能力和做事能力，不包括人的关系能力），也能被替代，一个替代不行，就两个，两个不行就五个，三个臭皮匠，顶过一个诸葛亮。 第二层次的个人：实战经验丰富的员工，通常能作为一个公司中层发挥冲锋陷阵的作用，但如果没有关系的建立，最终大概率也仅止于此。实战经验丰富的个人仍然是能被替代的，因为实战经验靠时间积累就可以得到。 第三层次的个人：当然，也有例外，即关键技术人员，一个顶成百上千个，没有他，技术就攻克不了，这种人的护城墙当然高，也是保持公司创新和护城河的动力之一。这种人不管对大公司还是小公司，都很重要，但通常小公司请不起这种人，或者本身就是小公司的创始人或合伙人。 所以要想提高核心竞争力，走得更加长远，不那么容易被替代的法则，最终一定是可靠关系的建立，连接重要于能力，越往后发展越是，两者也相辅相成。对公司、对个人是同样的道理。社会运转本质也一样。"
  },
  {
    "id": 24,
    "date": "2022-06-05",
    "title": "论是非对错黑白的标准",
    "summary": "自《邓小平时代》一书之后，再一次认识到，事情没有是非黑白对错，一味追求，很大程度上是秀才钻的死胡同，不利于问题的解决，甚至不是一种自洽的哲学。精确点说，加个定语，在这个社会中（历时性的空间），没有绝对的是非黑白对错。古今中外，一直如此。太极阴阳讲究平衡，辩证法强调分析事物两面性。无外乎此。以前经常会听人说，学生入世之后会被打磨，会变圆润，大概说的其中之一就是这个。也有一部分人坚信真理，现在的话说来就是归来是少年、理想、热爱、星光之类的。两者仍是无所谓对错。……总之，现在遇上问题，我习惯先在心里问上一句，这是标准吗？是规则吗？"
  },
  {
    "id": 35,
    "date": "2022-06-01",
    "title": "论国界",
    "summary": "我们应该记住，远离我们争吵不休的文化战争和政策辩论，让世界上的贫困人口获得物质丰富的安全和舒适，仍然是世界上最大和最重要的故事。"
  },
  {
    "id": 255,
    "date": "2022-04-30",
    "title": "🧎🏻",
    "summary": ""
  },
  {
    "id": 28,
    "date": "2022-04-29",
    "title": "论人工智能的危害",
    "summary": "对于那些大声疾呼人工智能取代人类，对人类生存造成威胁的伪媒体和信息，我真的也是不能苟同。大部分是人云亦云的产物，比如科幻作家这么写的，比如霍金这么警告的，而他们所描述的是在强人工智能领域。就目前的弱人工智能来看，造成的影响主要集中在两方面：一是人工智能的发展对传统行业的冲击，非创造性的岗位会被机器替代，本质是探索人与机器的关系问题。二是人工智能对信息分发甚至生产的垄断控制。越来越多互联网上的信息是被人工智能所控制甚至直接创造的，我们看到的搜索内容是人工智能让我们看到的，搜索引擎会为我们提供上亿条结果，但我们仅使用前面的几十条，我们在享受着数据便利的同时，也逐渐失去了意外收获的机会。“逛”是淘宝一大重要的产品定位，用户逛淘宝的过程和刷抖音的过程本质一致，软件抢占用户碎片化时间，流量为王，即便逛半个小时，接收到的仍是同质化内容。 我的体会是疲劳、没有心意，没有意外的收获。人工智能对信息的垄断控制，让人不安。 目前弱人工智能本身没有危害的目的，但在人工智能背后的人是有目的的，想让你看到跟多想看的内容，想让你浏览更多的时间，想让你购买为你推荐的商品，时间、精力、金钱在被攫取。更加恐怖的是，这一现象在众声喧哗之中逐渐湮没，占领制高点的话语平台会告知你，我们的系统性能多优异，我们为你成千上万人推荐了他们想要的，节约了资源与成本，我们在努力建立更大的生态，助力更多的人，承担更大的社会责任，无时无刻不在暗示这是一种”进步“，降低人们对”平台实质是一种垄断“的感知能力。媒体、企业、政府及其他机构合谋，个人渺小甚至没有感知。这多么像《1984》、《娱乐至死》、《乌合之众》中描述的”未来“场景。 我们一出生，人工智能系统就会根据我们的基因选择了最优的成长路径。我们会阅读最合适的读物、观看最合适的娱乐作品。衣食住行也都不用操心，全被安排妥当。到了适婚的年龄，智能系统会推荐最匹配的情侣，无论怎么算，我们的性格和其他个人条件都跟对方最搭。智能系统知道怎样让每个人开心，他会定时定量地给我们一些刺激。有时候是直接吃药，有时候是看一段有趣的视频，有时候是推荐给我们几个好玩的朋友。所有的痛苦都被抹杀。在这个乌托邦里我们只享受快乐。总之，每个人的一生都会高高兴兴地度过。根据智能系统的测算，这个时代的人类，在整个历史上都是最幸福的……"
  },
  {
    "id": 37,
    "date": "2022-04-28",
    "title": "论媒介的伪善",
    "summary": "之前应聘一家初创公司的区块链产品经理，给了当时的相对高薪，谈及区块链和当下火热的web3，对于其价值老板也是支支吾吾，最后翻出Polygon上的代币、唯一链以及后台代码给我看，我总结说是唯一标识、可溯源、去中心化，他说是这样的。但实际上在目前的我来看，仍然是投机倒把的行为，商品的唯一性和可溯源，就是去中心化了吗？类似地，互联网人人发言，但话语权力大小泾渭分明。虚拟化商品和唯一性仍然是以大公司的服务器集群为基础设施，&nbsp;昂贵成本目前为止仍然不是个人可以承担的，本质仍然是中心化的。倒来倒去，最终谁来承担流动的代价呢？跟着鼓与呼且啥也不懂的普通民众。 伪媒体和信息的疾呼，包括人工智能取代人类、区块链建立人类平等的想象乌托邦，是浮于表面的重要诱因，说白了就是啥也不懂乱吹牛带节奏。不过这又是另外一个悖论，参照人工智能的“三起三落”，如果新技术没有获得足够的社会关注度和热度，也不能带来足够的资本，当然也就没有研发投入。资本仍然重要，那么多人搞金融，社会要素的分工与投入。媒体则是这个分工过程中的鼓吹工具，具体鼓吹程度由事件本身的需求来定。研究生期间从信息传播的角度写过一篇区块链的课程论文，现在想想我甚至想用粗鄙一词来形容。 机器学习、神经网络、深度学习这些背后真正的能力是在数学、逻辑学、心理学、神经科学等多学科的基础上，一步步计算和验证出来的，单个计算模型如何演变为神经元，大量神经元如何构成一个神经网络，最后如何构建一个可以应用于处理实际问题的“谷歌大脑”一样的存在。谷歌大脑是逐步进化的，从最初的机器学习方法到后来的深度学习方法。 还是那句话，向生命臣服，坚持长期主义，All&nbsp;I&nbsp;know&nbsp;is&nbsp;that&nbsp;I&nbsp;know&nbsp;nothing."
  },
  {
    "id": 199,
    "date": "2022-04-23",
    "title": "关闭微信非聊天功能",
    "summary": "距离关闭微信看一看、视频号、朋友圈，尤其是订阅号，已经一个月了，仅作为单纯的通讯工具。目前感觉一切良好，甚至更好。尤其是把原来看订阅号碎片化的时间转移到微信读书上，焦虑感、使命感明显降低，得到了更多的距离感和私人空间。 偶尔从相册里进入朋友圈，发一个动态，在核心社交圈里释放一个“我还活着、我在做什么”的信号，是以前一个朋友专门提醒过的，也是有一定必要的。"
  },
  {
    "id": 197,
    "date": "2022-04-15",
    "title": "产品联合传播趋势",
    "summary": "行业优质的工具类软件，都将软件之间的功能联合、会员优惠、宣发合作作为一种常用的市场推广手段。不局限于flomo新兴软件，墨刀、坚果云、创客贴、语雀、ProcessOn等都采用了这种方式。这种方式既可能是早已有之，也可能是国内整个行业默认的方式，目的是教育会员付费和云上迁移的习惯。"
  },
  {
    "id": 196,
    "date": "2022-04-11",
    "title": "工具软件轻量在线化趋势",
    "summary": "轻量化、Web端化，表现在文本编辑类工具上，如notion、flomo、多种markdown编辑器等，也表现在专业类工具上，如幕布、processon、墨刀、figma等。"
  },
  {
    "id": 200,
    "date": "2022-03-21",
    "title": "关闭微信的信息传播渠道",
    "summary": "视频号嵌入微信生态越来越深入。未关注的视频号会像广告一样推送到订阅号消息列表中，比广告更进一步的是没找到关闭/不感兴趣的入口。 不干“低级产品教张小龙老师做产品”的事，但这次真被恶心到，因为私人空间被侵犯并达到门户大开的顶点。 下定决心迁移有内容价值的公众号至微信读书，仅保留工具类公众号，并关闭所有个性化推荐和消息推送。虽然这可能代表着生态内相关功能无法使用，但比起被侵犯且无主动权的感觉，我更愿意关掉看一看、视频号、朋友圈、订阅号等。 试试仅作为工具集合的微信如何。 不过讽刺的是，我正在用微信公众号后台写下这段文字。"
  },
  {
    "id": 195,
    "date": "2022-03-14",
    "title": "论在线思维导图",
    "summary": "processon的UI界面卡顿，UI效果不佳，还体现在会员功能设计上，有一股略微的“土味”，期待用户付费的念头明显；processon和幕布的一级标题无法备注，另外，processon文件名和一级标题无绑定关系，修改一级标题名称，文件名称不会同步改变，幕布一级名称与文件名称绑定；processon文件格式以第一次以第一次新建为主，即使后期更改，仍会以第一次格式为准，如此设计的问题在于用户某次操作将思维笔记转化成思维导图，下次打开还是第一次的格式，体验不佳。 关键在于其支持多文件格式的产品定位，而不是单一思维导图产品，既允许用户进行格式转化，又只限当前一次操作以保留支持多文件格式的产品定位，这种矛盾有点难以平衡。 相比，目前的幕布无需考虑多文件格式支持，只是单一的思维导图+思维笔记定位。processon可导出/导入文件类型比幕布多。processon允许思维导图的分支之间形成联系，构建更加复杂和完整的逻辑链路，如xmind，幕布不可以。这个功能个人觉得挺实用的，链接对于思维脑图的分支是个增强buff。接触幕布至今大概有三年，刚接触processon确实不太习惯。 工具类软件用户的使用习惯一旦确定，相对其他类型软件来说更加难以更改，因为工具类软件只有在使用的时候才会用到，这种使用频次和使用目的（工作、效率）决定了如果新工具没有极为突出的功能，是很难从老工具那里争取用户的。 纯web端与基于web端开发的本地客户端的最大区别在于，纯web端会占用大量的标签页，无法与其他网页区分开，而基于web开发的本地客户端兼具轻量化与便捷化的特征，对于完美主义者是个福音。 工具永远是提升人的效率，如果因为频繁切换或纠结于工具的差异性，忽略工具性本身，那就得不偿失了。"
  },
  {
    "id": 194,
    "date": "2022-02-14",
    "title": "论flomo产品传播",
    "summary": "flomo强调记录，旨在让用户保持随时随地随手的文字记录。而事实在架构、功能与交互上，没有突出的创新点，在相当多的其他产品上，都有相似的影子，包括Notion、GitHub、Microblog、滴答清单等。我认为，其最突出的创新在于三点：一是链接到各大平台的接口或入口，如微信输入、Google输入、Notion等，导出根于此，源于此，信息的流动性、产品的即时性（记录）、用户的数量，都得到相当程度的提升。 二是在第一点的基础上，进一步与具有间接竞品关系的产品联动，试图打造爆品功能点，并及时更新、总结、反馈给用户。并为间接宣传提供了绝佳的口径。 三是宣传的能力，创始人亲自下场，基于知识储备也好，发展经历也罢，打造个人与产品人设，在多个平台进行舆论造势，如微信公众号、即刻、产品沉思录、App Store。 通过以上三点，拉拢产品核心用户，形成优势意见的大声疾呼，不断扩大影响力，形成用户心智。 而本质，都是对信息传播学科的理解与运用。创始人真的很精通信息传播实战，也确实体现了其多学科交叉的知识储备，正如产品沉思录所示。信息传播造就用户共同的想象空间。"
  },
  {
    "id": 42,
    "date": "2021-12-08",
    "title": "论规则",
    "summary": "当有很多事情进入大脑时，你会判断是它究竟是不是自己想要的，是不是符合自己的心理内核偏好的。 在大部分时候，人的这种判断能力被蒙蔽，被弱化，即使我们常常声称这种判读是理性的，也会声称兴趣是有体验产生的，是可以靠后天培养的。然而，其本质是一种驯化而已。我们无法否认，心理内核是天生的，这种常常为人们所忽略。当然，也不否认，环境、背景、经历对一个人心理的影响是长期且潜移默化的，尤其是原生家庭和成长历程，这是我一直赞同的。 上述的蒙蔽/弱化作用，通常是以社会标准化的事物为媒介的。《人类简史》中称之为“想象建构的秩序”，以下引用之。这种秩序是一种为了整体社会进步而演化的标准，建立于人类共同的想象之上的，目之所及，包括工作、分工、礼仪、道德，更不用说资本、公司、政治这些组织形态。循环利用，价值投入产出，除了生活变“美好”之外，什么也没有。而这种美好生活或许这是一个口号，同样是一种标准。人被限制在把狭小的空间里，从远古的不断迁移到落地生根，到部落，到家庭，到社会组织形态诞生的，活动空间被进一步挤压，交通方式的发达造成的时空内爆掩盖了人的大部分生命被局限，自由活动时长被侵占的本质。办公室内的劳工，美名曰“白领”，车间里的劳工，美名曰“蓝领”，不管是脑力劳动还是体力劳动，绝大部分没有逃脱机械工作的范围。股票、钞票的跳动是一场数字游戏，资本家认为流动的才是有价值的，这种价值的是针对什么而言的呢？标准为何呢？ 在这个过程中，人自身到底是进步还是退步，是自由还是囹圄？相比来看，古代人在诸多场景中的束缚更小，更多常态是温饱的问题的关心。远古人在生存上挣扎徘徊，猿类基于动物本能行事。到了现代，关注什么呢？马斯洛的需求理论在分析需求时熠熠生辉，相比于以往，人类的基本需求会被全部满足，确实是社会生产力进步的结果，在这个意义上，常被认为是其合理性的证明，哪怕是我目前的思考也是基于这个的。 看似合理性掩盖了本质不合理性，蒙蔽了思考的眼界，自由想象的能力，而陷入共同的想象秩序中。苦于生计、迫于压力、人情世故、责任道德，除此秩序之外的是什么呢？我们无法得知，因为我们无法思考，我们下意识认为理应就是这些啊，还有其他的什么吗？但是，我们是否想过，为什么会有社会价值、个人价值呢？为什么会有两者的统一？ 一开始，人是有思考能力和拒绝能力的。整体社会语境下，来自教育的灌输，家庭的传递，潜移默化地涵化，最终难逃“视之为理所应当”的状态。最大的问题在于周围的人都是以此行事的，如果你想要推翻一个标准，就要说服所有人共同对抗这个标准，而说服又是重新建立标准和想象秩序的过程。观念的固化甚至会深入到基因之中，繁衍传承。 个人的反抗是撕裂的过程，瓦解旧观念和标准时，面临自己我认知的重构，这是毁灭的过程，而且也要具备创造的能力，赋予思想不一样的、于自己而言有感知、有意义的事情。实际上，意义本身也是一种标准。如果没有发现到需要打破，没有打破的决心，没有重建的能力，任何一个环节出现问题都无法完成自我身份认同和塑造，也会面临自我坍塌的巨大风险。 发现是一种过程，也有可能是某个瞬间。太多违背心理内核的东西占据脑海，这是一种填充，填充到一个极限，脑海中被固化标准的限制力就将被冲破。某个时刻，会疯狂呼喊，这不是我想要的，这一切不对，我无法关注我自己了，我无法处理这些事情了，这是在束缚我。我已经深刻感受到我要在诸多方面付出心力去维持、去应对，即使这些大部分是毫无意义的。 例如打字无法表达更加严肃的思考，因为文字够慢，可以不用催促思维跟上键盘表达信息的深度。但这不排除同样是环境塑造的，文字的线性表达方式已经契合了脑海思考的频率，这种频率随着大脑的发育逐渐固化。也许，对于从诞生开始接触电子产品的Z时代甚至更小点的用户来说，会产生与电子产品同频的输入输出能力。目前接触机器的前提仍然是学会通用符号的表达。 例如有线框，容易束缚人的表达。我们始终遵循那一条条经由市场或用户检验的线条行事。字迹大小是为了更加容易阅读和更符合大众审视，字迹是否工整、是否好看、混乱还是秩序都是被制定的标准。 例如，遮风挡雨的物件，为什么需要呢？迎接它而不是躲避它？深入基因的印象告知我们应该如此做，即使是动物。那这种特性是如何诞生的呢？或许，我们不仅可以打开思想、社会形而上的束缚，也可以打开生理束缚。"
  },
  {
    "id": 38,
    "date": "2021-12-08",
    "title": "论身体退化与长期主义",
    "summary": "今天突然发现我长期敲键盘的手有点不灵敏，就是冻住了，生锈了，又僵又硬的感觉。以前从来没有这种状态，太恐怖了。终于理解手球这个东西存在的价值，立马去淘宝上搜了一个。然后坐在工位上，拉伸手指。 人生是一个长跑的过程，必须保持有力的身体竞争条件，才能更接近于长期目标的实现。身体是革命的本钱，在科学技术未彻底解放人类生理技能限制的时候，是长期有效的。另外，在人的寿命逐渐增加，超出古人时，文化（三十而立等）和生理（二十几岁对女性来说是生育的好年纪）其实都该做出相应改变，事实上目前的改变不大。更不必说，人的成就和经历都是自己的，语境塑造的东西本就不该影响个人的选择和发展，可能在应对社会压力时，确实难以招架。"
  },
  {
    "id": 40,
    "date": "2021-12-08",
    "title": "工作方式的讨论",
    "summary": "明明就坐在隔壁，有什么问题直接当面沟通了不好吗，非要通过打字留言，这是什么毛病？好事、八卦迅速歪头讨论；坏事、不好说出口的任务网络沟通。美其名曰是人情世故，是合理选择沟通手段。这种工作氛围是要警惕的，需要审视的不仅是个人和团体，还要审视的公司，这并不是理所应当的。 另一个例子是会议。如果大量的时间浪费在了事先没有确定结果的会议上，或者是将真正的工作进度报告变成了成果展示颂赞以显示个人工作成果，都是高效的最大的阻碍。例如我们在公共讨论中，遇到与己不同的意见时，我们通常会说“我觉得这会有更好的解决方式，我个人觉得是不是可以这样，但你的这个做法也是可行的，我不是在否定你的说法”，其实本质是在浪费时间，社会语境和文化习俗塑造了这种交流方式。"
  },
  {
    "id": 39,
    "date": "2021-12-08",
    "title": "论媒体的伪善性",
    "summary": "有感于最近几天严肃新闻的曝光率和报到率较高，“研究生因导师压榨猝死、记者卧底世纪佳缘起底隐私泄露、美方将不派出官方代表参加北京冬奥会、内蒙古/宁波/上海/杭州疫情”等，部分属于社会新闻，作为议程设置的产物，对公众注意力的引导在某种程度上是好的。但也要考量议程设置的程度，媒体倒逼社会结构转型、推动社会变美好的力量多大，矫治到什么程度需要把控，毕竟互联网舆论是喧哗的、沉默的、裹挟的，避免矫枉过正或表面功夫。"
  },
  {
    "id": 188,
    "date": "2021-12-06",
    "title": "项目管理与研发流程思考",
    "summary": "开发任务分解与deadline执行 每个功能的任务分解，细化开发颗粒度，具体完成什么任务，什么时候完成，针对细化的颗粒度功能制定deadline，必须在deadline开发并按时上线。统一填入《任务分解计划》，由产品汇总至《版本迭代计划》。 上个周期的功能优化工作不算作下个周期的工作任务；项目外突发问题处理（紧急bug、遗留bug、领导问题、用户反馈等）算作当前周期的工作任务。由上个周期开发新功能导致的紧急bug不算作下个周期的工作任务；紧急bug、领导问题需要立马修复；历史遗留bug与产品讨论优先级后选择性修复。争取每个周期完成当个周期的全部任务，避免下个周期投入资源。自己根据当前周期开发进度安排工作、加班时间，严格执行需求变更与延期流程，所有变更与延期流程走研发系统，并落实到具体负责人，通过系统流程规范研发周期，形成习惯。 每周工作总结目前包括太多流程，为精简流程，根据优先级（itp&gt;朝夕日志&gt;周总结与规划），统一安排在周四填写，复制粘贴节省时间和步骤。备注：周总结与规划可以写入《周任务管理》。 后端提前开发完当前周期的接口后，在等待前端联调的过程中，投入到代码优化、系统遗留问题处理。为避免故意延迟当前开发进度，前端和后端在新功能开发、项目外突发问题处理两方面投入的资源比（暂且以人天为评估标准）尽可能维持在1:2。 功能性开发，预留一周时间测试，即5个工作日，第6个工作日晚发布上线。遇节假日，为给大家准点下班，发布日提前一天，测试相应减少一天。系统核心后端代码优化、服务替换等，预留至少两周时间测试，即10个工作日。遇节假日，发布日退后一天，测试相应增加一天。 开发结束后的一周，既是测试周期，也是留给开发的优化时间，主要用于代码优化、问题处理等。 如预研20%，开发30%，联调30%，测试20%，如预研20%，开发50%，联调20%，测试10%等。 一个研发周期内，项目外问题，包括bug处理、代码优化、用户反馈处理等，开发每个发版周期处理的项目外问题，都统一填入《项目外问题修复记录》，由产品汇总至《版本发布纪要》，专门记录当前研发周期内每个人的工作量。"
  },
  {
    "id": 187,
    "date": "2021-12-05",
    "title": "论媒介环境",
    "summary": "是能引导价值取向？还是能成为颠覆的力量？还是以为了解了自以为的真相就看透了世间万物，比大众更自由？ 哪一个颠覆的者是从揣着对社会、政体、制度的黑暗而起步的？难道说现在站在世界权力财富食物链顶端的人，都是从扒皮黑暗嘲讽时代起步的吗？即使他们在越走越高的路上，背后越来越多黑料。 所以这类“公知”、这类“自由”、这类“扒皮”，从反面来看，难道真是扮演启蒙、分享真相的先驱吗？难道不是借噱头炒作赚取注意力吗？说的是真相，难道不是吃瓜心理导致的另一种娱乐至死吗？ 最后获得了啥？获得了真相？获得了通透？获得了自由？都没有。付出的也是注意力，得到的也是无意义的怨念。以为是真相自由，殊不知陷入了虚无。 真相从来都是胜利者书写，而胜利者从来都是从小事出发，想要改变，必先融合、再体验、最后改之。看看野史、看看媒体、听听风声，还以为会当凌绝顶，一览众山小，实则身在此山中。 综上，最不自由的形式：一是ideology媒体报道，织造拟态环境网络，真假虚实、酸甜苦辣都是营造，事事要体验，沉溺或中毒。二是扒皮扒真相等形式的信息，啥也没有改变啥也没有意义，自媒体谣言和流言漫天飞，主流媒体把控舆论风向，大环境都被塑造好了，受众如一叶之扁舟飘荡在倾盆交加的信息洪流中。最终的结局都是：人云亦云，焦虑惶恐，浑浑噩噩，却，自以为通透自如，视野开阔。 解决方案： 保持批判性思考；保持学习，看书看书，而不是新闻资讯；从小事做起，亲身体验，而不光看书看书。 以下为思维发散： 提到体验，万物皆产品，用户需求不可信。产品经理的视角既要理解用户需求，也要提炼并转化，才是真需求。只要扮演的角色之一是用户/受众，在这一角色链条上，就不要妄图事物永远会朝自己希望的方向改变，黑天鹅永远存在。 对事物的看法也仅限于个人深耕和体验的领域，而不是类似于搞文学的批判科技，搞科技的批判文学、搞媒体的啥都批判的逻辑，因为其他领域你没有体验你就没有发言权。借鉴融合才共生。 提到搞媒体的啥都批判，凭什么是这样？媒体的本意是提供信息，诞生之际没有想到过最终的衍生会有偏向、会有控制、会有舆论等等，如果真的要媒体去做批判、要媒体去发表意见，干脆搞个“意见表达学”、“辩论学”，否则就是乱搞大众。所以涉及到任何其本身既有偏向的信息，媒体就不该只提供此类信息，因为信息本身的框架就含有偏向，无论你的语句多么公正多么客观。不该只提供偏向的信息，而应该提供与之对立的另一方的信息。最终使整个信息，由内到外，都是一个完善的客观的信息，才算是回归媒体最初的意义。 改变的前提是不偏不倚的态度和宏观视野，并且是站在大多数人的立场出发，思考对整体的好与坏，而不是对局部的好与坏。社会、职场、创业、皆是此般道理。"
  },
  {
    "id": 186,
    "date": "2021-12-05",
    "title": "论信息处理方式",
    "summary": "热点信息高度依赖于当下语境，其价值在某种程度上也是由语境赋予的。因此脱离开具体语境，再考量信息是否有价值。 大量时间花在资源囤积上，很少去整理复盘，而这些囤积的资源又给我们一种虚假的充实感，让我们继续忙碌于无用且繁复的囤积。因此分两步走：一是闲逛收集，二是复盘消化。 对于噪音，最好的处理方式是不去理睬，不看、不想、不产生情绪。因为一旦给予了注意力，它就得逞了，它的目的就是为了赚取你的注意力。这不是失去了它们，只是淘汰了没有价值的信息。"
  },
  {
    "id": 185,
    "date": "2021-12-02",
    "title": "微信读书时长排行榜思考",
    "summary": "基于微信社交关系的排行，对用户具有激励作用。阅读时间代表了用户沉淀，是一种基于社交关系的沉淀，增强了产品黏性。随着阅读时间的显性增加，用户的产品忠诚度会不断提升。 原理：游戏性机制和等级/积分机制。核心在于胜负和奖惩机制，通过时长的累积，给予用户积分奖励，登录阅读1分钟，奖励1天无限卡（拉新的有利手段），之后每达到1小时、3小时、5小时的阅读时长，可以选择无限卡或书币奖励。赠送的免费无限卡的天数是有限制的，用较低成本刚好刺激用户那个点，引导每日持续打卡阅读（留存）。7日签到额外奖励的设定强化了每日打卡行为和周目标，防止用户每日重复签到行为失去动力。另外，翻牌领取随机无限卡天数，为每日签到增加了趣味性（促活）。 同样的例子还有，阅读天数、勋章、免费无限卡、书币等。 但是，微信读书中内置的听书功能，听书时长也算作整体读书时长的一部分，明显破坏了排行榜本身的公正性，降低用户激励机制。换句话说，激励机制可能会变味。听书较看书，作为一种门槛稍低的方式，会被用来刷时长。 听书的倍速与实际时长的关系也是有思考的空间，1.2倍速听了1个小时的书，统计时长是算1小时，还是1.2小时呢？ 读书也能做出来社区意见领袖，显著特征就是个人主页显示的读书时长，收到的赞，粉丝数，书架。前三者相当于社区内容的粉丝数，书架相当于UGC内容。 然而，阅读是一个相对私密的事情，用户需要有独处和思考的空间。如果从这个角度来看的话，读书这种私密行为被放大到前台进行展示，将表演意义附加于读书之上，本身的“符号-意义”和其他很多现象被潜移默化地重定义。也是一种贩卖焦虑的体现。 说到贩卖焦虑，我在周日下午剪指甲时，发散了一下。似乎日常生活中，我们越来越习惯或主动进行“一心二用”的行为。多事件并行，多状态叠加，实际就是一种生存空间被挤压的表现，在串行事件的时间流中，我们更专注当前的一件事，参与感和体验更足，获得的愉悦或其他反馈也会更强。一方面教育上/工作中呼吁我们一心一意，专注于手头上的事情，另一方面社会文化规制我们同时进行更多的事情，以显得更加高效。强调单一感官参与的状态以获取更强的体验，似乎与麦克卢汉所说的电视媒介更容易让人回归感官平衡的状态，相互冲突，而与冷媒介的意义相互照应，单纯地沉浸于一种媒介中（如报纸），受众参与感会更强。事实也确实如此。例如吃饭的时候刷视频/看电视，做饭/洗澡/剪指甲的时候听音乐/听播客，看着综艺的时候拿出一本书假装我们在两件事上都有进展。我们恨不得调动全部感官同时进行多种事情。"
  },
  {
    "id": 46,
    "date": "2021-09-26",
    "title": "论语言对意义的塑造",
    "summary": "《臣服实验》开篇给了我警钟，忽然发现，虽然我从大学开始用尽全力“发掘自我”与“追求卓越”，但时常在语言表达过程中被替换、遮蔽，反过来又影响潜意识对其的认知，比如最近某些场合会宣扬“把握时局”的重要性。事实上“卓越”、“时局”都不过是为“自我”服务的工具之一。“生命事件的自然潮水会将我引向何方”远比“以自我方式抗争自然方式”更加有趣。究其原因，一是语言符号匮乏，二是词不达意，三是信息噪音影响。 学习信息科学，掌握信息方法论的同时，也面临置身于庞杂的信息场域中，随时被冲击、涵化、颠覆的风险。"
  },
  {
    "id": 372,
    "date": "2021-09-14",
    "title": "",
    "summary": "王阳明《传习录》中记载：先生曰：“拟经恐未可尽非。且说后世儒者著述之意，与拟经如何？” 王诗沐《幕后产品》中对于模仿、借鉴其他产品设计的观点应该来源于此。模仿优秀产品，创造好产品的初心不变，那么这种模仿是可以接受的。"
  },
  {
    "id": 223,
    "date": "2021-09-12",
    "title": "后行沟通",
    "summary": "沟通中，只关注沟通的内容，而不是对方的态度、形式、语气等。中国人最在乎面子，如果没面子，就不会讲道理，其实是中国人感性，相比于西方人，缺乏理性。因此，中国人的沟通最重要的是情绪管理。 对西方人来说，直话直说，对方只会关注说话的内容，对中国人来说，直话直说容易伤害人。投石问路，铺垫，在合适的时机说妥当的话。 先说落于下风，不说也落于下风。如何做到“说到不落于下风”？ 让对方先说，让对方做决定。"
  },
  {
    "id": 225,
    "date": "2021-09-10",
    "title": "论面试",
    "summary": "实用主义与目标导向 面试的时候，说自己完美主义，不一定是好的。在项目管理中，一切最好以实用为基准，也可以说是目标导向/目标驱动。在项目过程中，对一切因素要有取舍，不一定要做到最好，平衡好绝大部分利益相关方，一切有利于目标实现最重要。 目标驱动与自我驱动 目标驱动和自我驱动是相辅相成，不可分割的。我们平时说的自己有很强的驱动力，有自觉能动性，其实这句话的前提是面对一个目标，一件事情，一个需要我们去实现的价值时，才会体现是否具有驱动力、能动性，没有目标，没有希望实现的价值，往哪里驱动？另一方面，没有自我驱动力，即使定了目标，我面对目标无动于衷，没有自我驱动和希望实现的愿望，目标也实现不了，自我驱动是实现目标的手段。 明确、量化、跟踪目标 目标导向的前提是，必须明确好目标，使目标可量化、可跟踪的。不能模棱两可、不懂装懂，防止项目路线偏差。不只是目标的量化，涉及到目标、资源、进度、风险等都尽可能用量化管理，就像中式烹饪经常说姜三片/葱四段，而德国烹饪会说姜15g/葱30克。 提供资源，把控方向，监督进展 为项目提供资源，在实现的大方向予以把控、监督。具体的实现技术和策略，不必事必躬亲，懂得用人，懂得角色分工。事必躬亲意味着个人主义，个人主义也不是不好，项目经理和产品经理更偏需要全栈能力，个人主义是什么活都揽过来，自己做自己实现，全栈能力体现在各个环节中的管理上，角色分工意味着集体主义，大家做好自己的事情，共同推动项目实施。 现实 表面上围绕着范围、进度、成本等，实际中，一切都是基于沟通技巧，风险（评估与管理），期望（相关方期望管理与目标实现）。沟通技巧本质是人情关怀、为人处事、用人管理的方法论。"
  },
  {
    "id": 45,
    "date": "2021-09-05",
    "title": "教育与成长",
    "summary": "焦虑和痛苦是生活中的一个常态。真正的风险，一是钻牛角尖，二是赌博/孤注一掷，三是不理性消费（包括不承担任何责任，陷入某种浪漫主义陷阱，处于一种狂热的、宗教性、盲性的状态，与外界疏远）。 不需要去做杜威式的精确设计，非程式的、非现代的、非消费的、非制度化的经历都有很大好处；对冲式的综观，孩子遇到命题判断、命题颂赞，给予孩子多方面思考的角度，给予更孩子更多元的视角；在人类已经拥有了无数作品的前提下，选择一些循序渐进的作品，使孩子的兴趣获得深度，形成一种旨趣。"
  },
  {
    "id": 44,
    "date": "2021-09-05",
    "title": "论规则与意义",
    "summary": "触摸万事，归于终极问题，想不出什么头绪。 规则掩埋本质，终是虚无。 万千人生，所谓通透，仍是定义。 我一直信奉自然科学能解决一切问题，信奉E=mc2的定理性，实际在不同维度或是尚不可认可的维度，仍可能被推翻，正如牛顿拨开了自然法则谜雾，量子力学又重新颠覆经典力学。以解放思想为名的科学主义掩盖的是相对主义和虚无主义的蔓延，又是陷入另一种禁锢。 人类思维怪圈，似是基因陷阱，也似是历史框架，隐秘且难跳脱。 科学主义丧失终极关怀的副作用刻骨铭心，人本哲学提供的方法论或许会有大裨益。"
  },
  {
    "id": 48,
    "date": "2021-08-29",
    "title": "《人世间》",
    "summary": "乔一成：传统、局限；责任、努力。像乔祖望一样的城里人其实是人模狗样。农村人在电视里的形象就被塑造死了，“土”、封建、爱占便宜等，但确实也有农村人形象是这样。北大的齐唯民又是“北大”刻板印象，有思想、进步青年等，也可能是镜头少，聚焦得少，信息少不足以判断事物全貌。其他人不一一列举。每个人的角色都很鲜明，每个人都是时代的产物。尤其是普通人，接触不同的事物，自己就会受时代中各种各样的一小撮风潮的影响，就被塑造成不同的样子，每个人就接触了不同事物，有不同的经历，就不同的性格。电视剧改编小说，目的使其更具戏剧性，让电视剧更有看头，吸引流量。 我很讨厌这种框架。不过我突然又想到，自己评价别人的自我框架也是一种框架，应该思辨再思辨。乔一成被骗就被骗呗，他自己觉得幸福就行，结婚也无所谓，给钱填空子也无所谓，还有他爹、他弟、妹等，都是一种框架，都是自己的人生。我自己以为的东西。是自小甚至自古以来的文化通过教育、环境、习俗等方式印在脑子里的框架，都应该打破。一是重新定义框架或继续完善已有框架；二是每个人都是框架，优劣是有的，但无法趋同一致，那是上帝才能做到的，或者是机器人。无所谓，哎对，就是玩。 稍以这种逻辑思考，有点恐怖的是，似乎无法从电视剧及其他的人为创作艺术中获得共情，触动少了很多，因为一切都是自我框架，自己评判、思考、再定义。"
  },
  {
    "id": 47,
    "date": "2021-08-23",
    "title": "论男女性",
    "summary": "工具性和表达性特质不专属于某一性别，大部分社会偏见与刻板印象都是性认同差异造成的，根本在于文化长远且跨代际的影响，主要是树立榜样和社会化两种方式。 社会现实往往认为男人比女人更多受性驱动，女人更容易受情感驱动，如夸赞、依偎、亲吻等，事实是这种平均差距并不明显，两性也不对立。 原来这些议题确有数据与案例支撑。 “长期来看，与表达性低的配偶结婚的人就不如与那些更敏感、贴心和友善的人过得满意”。"
  },
  {
    "id": 43,
    "date": "2021-08-10",
    "title": "论死亡",
    "summary": "关于衰老与死亡，震撼于作者（《最好的告别：关于衰老和死亡》）对其父亲的故事结局的描述，震撼于死神疯狂试探、日益接近的濒死时光，还徘徊于人行将就木之时的多重矛盾之中。无自决能力的人其生命轻也重，承担其生命责任的人即使是亲人，也面临复杂考验。主要在于延长痛苦的错误或缩短宝贵生命的错误之间的取舍，建构个人故事完整性或延长故事长度之间的考量。 设身处地想想，目前我的心智既无法接受亲密关系中另一方短期可预见的期限，也不能接受他们无告别的突然离去。"
  },
  {
    "id": 221,
    "date": "2021-05-19",
    "title": "论模仿产品",
    "summary": "王阳明《传习录》中记载：先生曰：“拟经恐未可尽非。且说后世儒者著述之意，与拟经如何？” 王诗沐《幕后产品》中对于模仿、借鉴其他产品设计的观点应该来源于此。模仿优秀产品，创造好产品的初心不变，那么这种模仿是可以接受的。"
  },
  {
    "id": 226,
    "date": "2021-04-28",
    "title": "游戏成瘾度设计",
    "summary": "云顶之弈棋子的概率可能随赛季阶段变化。 波动性刺激而非长期刺激用户的爽点，类似无限火力。既塑造用户成瘾行为，又防止其心理疲软。"
  },
  {
    "id": 222,
    "date": "2021-04-11",
    "title": "论交往的连接",
    "summary": "人与人之间的交往和相处，其本质是建立在多个维度的连接之上的。 以下所举例的维度都是强调，在这一维度上的连接。越多维度的连接，人与人之间就能建立越亲密的关系。 这里说的维度，其实就是一个角度、一个规则，在某个方面的共识。这里说的“共识”不一定是相同的看待事物的基础，而是想要强调一种融合的状态，超越同与不同的概念，纯粹是人与人之间相处的一种融合状态。 作为类比，相当于一个点对点结构，两点就是两个人，点与点的连接不是一条线的简单连接，也不是一个平面的多条线的连接，而是多个平面的多条线的连接，即立体状态。点与点间的每一条线就是人与人之间相处的一个维度，也就是连接的一个维度。 这样，线条越多、维度越多，人与人之间的连接就越强，越亲密。 具体来说，举几个例子： 综上，如果人与人之间的在多个维度的强连接断裂了，或者说在多个角度达不成一种“共识”的状态，那关系即将破碎。反之，关系亲密。尤其需要强调，这个“共识”是超越同与不同、互不互补等等概念的一种融合态。 这些维度可能包括：思考、想法、观点、目标、态度等等。"
  }
];
